{
  "speaker": "Vice Chair for Supervision Michelle W. Bowman",
  "speeches": [
    {
      "title": "Welcoming Remarks",
      "date": "2025-07-15T00:00:00",
      "location": "At \"Unleashing a Financially Inclusive Future,\" the second annual Financial Inclusion Conference hosted by the Federal Reserve Board, Washington, D.C. (via prerecorded video)",
      "url": "https://www.federalreserve.gov/newsevents/speech/bowman20250715a.htm",
      "content": "Accessible Keys for Video\n[Space Bar]toggles play/pause;\n[Right/Left Arrows]seeks the video forwards and back (5 sec );\n[Up/Down Arrows]increase/decrease volume;\n[M]toggles mute on/off;\n[F]toggles fullscreen on/off (Except IE 11);\nThe[Tab]key may be used in combination with the[Enter/Return]key to navigate and activate control buttons, such as caption on/off.\nGood morning. I'm very pleased to welcome you to the second annual Financial Inclusion Conference hosted by the Federal Reserve Board.1Last year, at our inaugural event, I underscored that financial inclusion is essential for creating an economy that works for everyone, with innovation in the financial sector playing an important role.2\nThis year's conference builds upon increased engagement across both the public and private sectors, with a collective effort to leverage technology to broaden financial service access and improve the financial well-being of consumers and small businesses. The Federal Reserve will continue to play an important role in these efforts through its research, community engagement, and regulatory approach. This work supports our ability to understand and communicate the state of financial inclusion, how banks support access to affordable financial services, and the role that our policies and practices play in promoting inclusion.\nProgress to DateBanks of all sizes are working to improve access to financial services for all Americans. As I've noted in the past, the U.S. banking system is well-positioned to bring consumers and small businesses into the financial mainstream by providing access to safe, fair, and responsive financial products and services.3These efforts greatly benefit from our continued focus on broader access and innovation, including understanding how our supervisory and regulatory framework either supports or impairs a bank's ability to provide affordable financial services that are consistent with safety and soundness.\nInnovation comes in many forms. One example is through banks' use of alternative data, which can enable banks to provide services like affordable small-dollar loans or to provide access to credit invisibles who may not have access to loans and other financial services from traditional lenders.4This growing area of focus also helps align financial service offerings with a customer's financial goals.\nA well-functioning financial system provides a foundation for strong consumer financial health. To further this, the federal banking agencies recently published a request for information on check and payments fraud to help address the impact of this growing problem on banks and their customers. I am committed to working together with a wide range of state and federal partners, including law enforcement, to address this issue.5\nA More Financially Inclusive FutureAlthough there has been significant progress in providing access to financial services, there is more work left to be done. We know that financial institutions, both small and large, are working to build innovative approaches to meet their customers' needs while maintaining the safety and soundness of the banking system.\nToday's ConferenceThe theme of this year's conference is \"Unleashing a Financially Inclusive Future.\" Today, we will hear from a number of experts that will help to explore what the future might hold for financial inclusion. Our next presenter, Jo Ann Barefoot from the Alliance for Innovative Regulation, will discuss the role of banking industry innovation and policies in support of financial inclusion. Later in the day we will hear from three panels focused on topics including evolving products and practices, the role of mission-driven organizations, and how cross-border payment innovations can facilitate the movement of money around the world.\nI would like to thank you all for joining us today and I will turn it over to Art Lindo, Deputy Director and Head of Policy in the Board's Division of Supervision & Regulation, to introduce Jo Ann Barefoot.\nThank you for the opportunity to join you virtually today, and for your ongoing commitment to support a financially inclusive future.\n1. The views expressed here are my own and are not necessarily those of my colleagues on the Federal Reserve Board or the Federal Open Market Committee.Return to text\n2. See Michelle W. Bowman, \"Promoting an Inclusive Financial System (PDF),\" speech delivered at Financial Inclusion Practices and Innovations Conference at the Federal Reserve Board of Governors, Washington, D.C., July 9, 2025.Return to text\n3. Bowman, \"Promoting an Inclusive Financial System.\"Return to text\n4. For more details on regulations related to alternative data use in credit underwriting and small-dollar lending, see Board of Governors of the Federal Reserve System, \"Interagency Statement on the Use of Alternative Data in Credit Underwriting,\" CA letter 19-11 (December 12, 2019), and Board of Governors of the Federal Reserve System, \"Interagency Lending Principles for Making Responsible Small-Dollar Loans,\" SR letter 20-14/CA 20-8 (May 20, 2020).Return to text\n5. See Board of Governors of the Federal Reserve System, Federal Deposit Insurance Corporation, and Office of the Comptroller of the Currency, \"Federal Bank Regulatory Agencies Seek Comment to Address Payments and Check Fraud,\" press release, June 16, 2025.Return to text"
    },
    {
      "title": "Unintended Policy Shifts and Unexpected Consequences",
      "date": "2025-06-23T00:00:00",
      "location": "At “Assessing the Effectiveness of Monetary Policy during and after the COVID-19 Pandemic,” a research conference sponsored by the International Journal of Central Banking and the Czech National Bank, Prague, Czech Republic",
      "url": "https://www.federalreserve.gov/newsevents/speech/bowman20250623a.htm",
      "content": "Thank you for the invitation to join you today.1As the Federal Reserve's Vice Chair for Supervision, I am responsible for, among other things, leading the Board's Division of Supervision and Regulation in its work to promote the safe and sound operation of the U.S. banking system. While this includes the specific activities of bank supervision and regulation, the financial system reaches far beyond the banking system. Regulators must also monitor the effects of activities that extend outside this perimeter, for example activities that have migrated from banks to non-banks, or when there are broader market implications of regulatory actions and their potential effects on financial stability. Regulations should not be created in a static world of \"set it and forget it.\"\nToday, my remarks will focus specifically on how the passage of time—with underlying changes in the composition of the economy and the financial system, interest rate shifts, and patterns and preferences of banking and financial activity—can lead to unintended policy application and unexpected consequences. Regulators should consider these broader evolving dynamics as they craft regulations to endure beyond today's circumstances.\nTypically, these effects are not contemplated in the scope of the usual cost-benefit analysis, as shifts occur over time after a new rule or regulation is implemented or enacted. But shifts can, in effect, become new policy choices with consequences that can pose significant issues.\nOne shift in particular is that of the supplementary leverage ratio increasingly becoming the binding capital constraint for the largest banks in the United States. The U.S. banking system includes two basic types of capital requirements: risk-based requirements that impose a capital \"charge\" based on the underlying risk of a particular activity, and leverage-based requirements that do not differentiate based on the risk characteristics of underlying assets. And while leverage-based capital requirements are generally intended to operate as a backstop to risk-based requirements, changes in the financial system and the broader economy can alter this relationship between capital requirements. This shift in the nature of leverage-based capital requirements, from backstop to binding constraint, was not driven by a deliberate policymaking process, but rather by the maintenance of a high level of reserves in the banking system, as well as the introduction of liquidity requirements that compelled banks to replace loans with high-quality liquid assets.2\nMonetary Policy and Economic OutlookBefore turning to the main theme of my remarks, I would like to give a brief update on my outlook for the economy and monetary policy.\nAt the Federal Open Market Committee (FOMC) meeting last week, the Committee voted to maintain the target range for the federal funds rate at 4-1/4 to 4‑1/2 percent and to continue to reduce the Federal Reserve's securities holdings. I supported this decision because the data shows a solid labor market and I would like to see further confirmation that inflation is close to our 2 percent target on a sustained basis.\nIf inflation remains near its current level or continues to move closer to our target, or if the data show signs of weakening in labor market conditions, it would be appropriate to consider lowering the policy rate, moving it closer to a neutral setting.\nAt this point, we have not seen significant economic impacts from trade developments or other factors, and the U.S. economy has continued to be resilient despite some slowing in economic growth. Private domestic final purchases (PDFP) growth slowed to a moderate pace in the first quarter, even as activity was partly boosted by a pull-forward of spending on motor vehicles and high-tech equipment ahead of the implementation of tariffs. Although the pull-forward of spending appears to be unwinding, retail and motor vehicle sales through May provide further evidence that PDFP has softened so far this year.\nThe labor market appears to remain solid, with payroll employment rising about 140,000 per month, on average, in April and May, only slightly below the average monthly gains over the past two quarters. This pace of job gains appears consistent with the unemployment rate remaining at a low 4.2 percent through May, which is roughly unchanged since the middle of last year.\nThe labor market appears to be stable near estimates of full employment, with layoffs remaining low. The number of job openings relative to job seekers has moved roughly sideways since the middle of last year at, or a touch below, the pre-pandemic level. And the labor market no longer appears to be especially tight or a significant source of inflation pressures, as most wage growth measures have slowed closer to a pace consistent with 2 percent inflation.\nTurning to inflation, we have seen a welcome return to further moderation of personal consumption expenditures (PCE) inflation over the past three months. The May consumer and producer price reports suggest that 12-month core PCE inflation stood at 2.6 percent in May, down meaningfully from its elevated reading of 2.9 percent at the end of last year. Similar to the past two years, elevated monthly inflation readings in January and February have been followed by low readings as we move into the spring.\nOn a 12-month basis, core PCE goods inflation has picked up somewhat since last December, but this has been more than offset by a considerable slowing in core PCE services inflation. It appears that any upward pressure from higher tariffs on goods prices is being offset by other factors and that the underlying trend in core PCE inflation is moving much closer to our 2 percent target than is currently apparent in the data. With housing services inflation on a sustained downward trajectory, and other core services inflation already consistent with 2 percent inflation, only core goods inflation remains somewhat elevated likely reflecting limited passthrough from tariffs.\nWith economic growth slowing, it is possible that recent softness in aggregate demand could be starting to translate into weaker labor market conditions. While still strong, the labor market appears to be less dynamic, with modest hiring rates, layoffs edging up from low levels, and job gains concentrated in just a few industries. With inflation on a sustained trajectory toward 2 percent, softness in aggregate demand, and signs of fragility in the labor market, I think that we should put more weight on downside risks to our employment mandate going forward.\nDespite progress on lowering inflation, there are potential upside risks if negotiations result in higher tariffs or if firms raise goods prices independent of any tariff pass-through. Although we have not seen evidence of disruptive impacts on supply chains, changes in global trade patterns could lead to an increase in prices for goods and services. The current conflict in the Middle East or other geopolitical tensions could also lead to higher commodity prices.\nI am certainly attentive to these inflation risks, but I am not yet seeing a major concern, as some retailers seem unwilling to raise prices for essentials due to high price sensitivity among low-income consumers and as supply chains appear to be largely unaffected so far.\nMeasures of policy and economic uncertainty have receded from recent highs, and measures of consumer and business sentiment have also improved in recent weeks after having dropped considerably. These developments reinforce my view that concerns will subside as more clarity emerges on trade policy. Businesses appear to be resuming investment and hiring decisions, as they feel increasingly confident that less favorable trade outcomes are unlikely to occur.\nI remain focused on how new policies evolve and whether future data releases will provide perspective about their economic impacts. On trade policy, I expect that negotiations will ultimately result in lower tariff rates than are currently in place, consistent with the resumption of financial market optimism. Further, should we see effects on inflation this year, I expect that increased slack in the economy will limit this to a small, one-off impact.\nSmall and one-off price increases this year should translate only into a small drag on real activity. I also expect that less restrictive regulations, lower business taxes, and a more friendly business environment will likely boost supply and largely offset any negative effects on economic activity and prices.\nIn considering the risks to achieving our dual mandate, I fully supported the revised characterization of uncertainty and the balance of risks in our most recent monetary policy statement, pointing to the diminished uncertainty and removing the emphasis on risks to both sides of our mandate. In my view, it was appropriate to recognize that the balance of risks has shifted. In fact, the data have not shown clear signs of material impacts from tariffs and other policies. I think it is likely that the impact of tariffs on inflation may take longer, be more delayed, and have a smaller effect than initially expected, especially because many firms front-loaded their stocks of inventories. And, all considered, ongoing progress on trade and tariff negotiations has led to an economic environment that is now demonstrably less risky. The change in our monetary policy statement appropriately incorporates this shift in the balance of risks as well as the rapid improvement in many measures of uncertainty.\nAs we think about the path forward, it is time to consider adjusting the policy rate. As inflation has declined or come in below expectations over the past few months, we should recognize that inflation appears to be on a sustained path toward 2 percent and that there will likely be only minimal impacts on overall core PCE inflation from changes to trade policy. We should also recognize that downside risks to our employment mandate could soon become more salient, given recent softness in spending and signs of fragility in the labor market.\nBefore our next meeting in July, we will have received one additional month of employment and inflation data. If upcoming data show inflation continuing to evolve favorably, with upward pressures remaining limited to goods prices, or if we see signs that softer spending is spilling over into weaker labor market conditions, such developments should be addressed in our policy discussions and reflected in our deliberations. Should inflation pressures remain contained, I would support lowering the policy rate as soon as our next meeting in order to bring it closer to its neutral setting and to sustain a healthy labor market. In the meantime, I will continue to carefully monitor economic conditions as the Administration's policies, the economy, and financial markets continue to evolve.\nIt is important to note that monetary policy is not on a preset course. At each FOMC meeting, my colleagues and I will make our decisions based on the incoming data and the implications for and risks to the outlook, guided by the Fed's dual-mandate goals of maximum employment and stable prices. I will also continue to meet with a broad range of contacts as I assess the appropriateness of our monetary policy stance.\nBringing inflation in line with our price-stability goal is essential for sustaining a healthy labor market and fostering an economy that works for everyone in the longer run.\nPolicy Shifts and Unintended ConsequencesIn my responsibilities over bank regulation and supervision at the Federal Reserve, I intend to apply a pragmatic approach. We will review data and evidence, identify problems that need to be resolved, and develop efficient solutions to address those identified issues.3While the regulatory authority of the Federal Reserve is primarily related to the banking system, theconsequencesof banking regulation and supervisory efforts are not limited to the banking system. Bank regulation and supervision affect how financial activities are conducted, the cost and availability of credit and financial services, and even what types of entities provide those services. While it is important to consider the consequences of regulatory actions as they evolve over time, in cases where regulation may create or exacerbate financial stability risks, we must examine whether those risks are justified by the safety and soundness benefits of the regulation.\nBank-affiliated broker-dealers play a critical role in U.S. capital markets, including in Treasury market intermediation activities. Today I will discuss the lessons we have learned about how bank regulatory requirements, specifically leverage ratios in the United States, can have unintended consequences. Leverage ratio impacts on bank-affiliated broker-dealers can have broader impacts, including market impacts like those observed in Treasury market intermediation activities. Once we've identified \"emerging\" unintended consequences—issues that were not contemplated during the development of a regulatory approach—we must consider how to revisit earlier regulatory and policy decisions.\nAs I will discuss in greater detail shortly, regulators must act quickly to address the growing problems with increasingly binding leverage ratios. In 2021, in connection with the expiration of temporary, emergency changes to the supplementary leverage ratio (SLR), the Federal Reserve committed to \"soon\" inviting public comment on potential modifications.4Over four years later, a proposal has not been issued, and problems with Treasury market intermediation continue to emerge. The time has come for the federal banking agencies to revisit leverage ratios and their impacts on the Treasury markets.\nLooking at the Data: Treasury Market FunctioningAs a first step in this pragmatic approach, it is important to look at what the data says about Treasury market functioning. This is a necessary first step before we determine whether there are issues or problems that can be addressed through adjustments to bank regulatory requirements.\nA review of Treasury market data provides a history of growing issues with Treasury market functioning. In recent years, U.S. policy debates have highlighted the need to take preventative measures to ensure smooth market functioning. One issue that continues to persist is low levels of Treasury market liquidity as the Board's semiannualFinancial Stability Reportnoted.5In addition, some dealers experienced balance sheet pressure in intermediating record volumes of Treasury market transactions in the spring, at a time when reports from market participants also indicated reduced demand from other Treasury investors.6\nA survey of market participants from the Fed's most recentFinancial Stability Reportnoted that more than a quarter of respondents cited Treasury market functioning as a risk to the U.S. financial system and the broader global economy. This was an increase from the same survey conducted last fall when 17 percent of those surveyed cited Treasury market functioning as a risk.7\nRecent changes to Treasury market clearing activities from the Securities and Exchange Commission's central clearing requirement for U.S. Treasuries were implemented to improve Treasury market functioning. Once fully implemented, these changes may improve market functioning. The Federal Reserve's Standing Repo Facility may also help to promote smooth functioning in the Treasury market. But it is unclear how the ongoing increases in the volume of Treasury issuance, the volume of Treasury securities outstanding, and changes to the Fed's balance sheet over time, may also affect market liquidity.\nTreasury markets have experienced stress events as recently as the September 2019 repo market stress, and the so-called \"dash for cash\" in March of 2020. In early April, we also saw strains in Treasury cash markets. Although markets continued to function, there were unexpected moves in Treasury yields, with an initial drop in yields followed by a sharp increase that seems to have been driven in part by the unwinding of the swap spread trade by leveraged investors in response to declining swap spreads.\nWe do not know exactly what circumstances may lead to a future stress event or how it will manifest, and continuing to impose unwarranted limits on dealers' intermediation capacity could exacerbate a future stress event in this critical market. But we do know that these events have raised concerns about the resilience of U.S. Treasury markets. Therefore, we should continue to actively monitor indicators of market functioning. Recent trends in both market liquidity indicators and survey responses suggest that this problem has persisted and may be becoming more severe. Low liquidity can create more volatility in prices, exacerbate the effects of market shocks, and threaten market functioning.\nIdentifying the Problem: Looking Beyond Treasury Market IntermediationLarge bank-affiliated primary dealers play a vital role in the intermediation of U.S. Treasury markets. These dealers are subject to, not insulated from, the effect of banking regulation. While many factors can affect market liquidity, including the growing volume of Treasury issuance, Treasury market saturation, and interest rate volatility, we must consider whether some of the pressure is a byproduct of bank regulation. Due to the role of large banks in the intermediation of Treasury markets, there is a direct link between banking regulation and Treasury market liquidity, particularly when it comes to the growth of \"safe\" assets in the banking system and the increase in leverage-based capital requirements becoming the binding capital constraint on some large banks. In 2018, the Federal Reserve along with the Office of the Comptroller of the Currency (OCC) proposed significant changes to the enhanced supplementary leverage ratio (eSLR) that applies to the largest banks.8These revisions were never finalized, but the intent behind them was to return the eSLR to its traditional role as a backstop capital requirement instead of what has become a substantial balance sheet constraint.\nThe proposed change was designed to promote resilience in the banking system and to protect financial stability, while also maximizing credit availability and economic growth throughout the credit cycle.9During the COVID-19 pandemic, the Federal Reserve addressed constraints on the ability of U.S. banks to support efficient Treasury market functioning by temporarily excluding Fed reserves and Treasuries from the denominator of the SLR.10\nThe central role of bank-affiliated broker-dealers in Treasury market intermediation has led us to take a close look at bank regulatory requirements to clarify how these requirements, particularly their calibration, may impact Treasury market functioning. Although designed to address low risk activities, like Treasury market intermediation, leverage ratios have become increasingly binding as a bank capital constraint as market conditions change.\nWhile issues around the use of leverage ratios require close examination, a solid capital foundation in the banking system is critical to support safety and soundness and financial stability. Revisiting the calibration of leverage ratios to ensure that they remain backstops instead of creating binding constraints, especially in times of stress, should not be interpreted as a critique of the role of capital in a robust regulatory and supervisory framework.\nBut to be clear, theconsequencesof an overly restrictive leverage ratio go well beyond just Treasury market intermediation, and impact a wide range of low-risk activities. Leverage capital requirements do not differentiate between the risk of different asset classes or exposures.\nHowever, in periods when bank balance sheets are expanding—like the significant deposit inflows during COVID-19—leverage capital requirements can unintentionally become the binding constraint on both banks and their affiliates. This increases the amount of required capital as bank balance sheets grow, regardless of the underlying risk. When constrained in this way, bank-affiliated primary dealers may pull back on the market intermediation of low-risk assets like U.S. Treasuries. A binding leverage capital requirement can create perverse incentives for banks to shift their balance sheets into higher risk assets, since doing so could generate larger returns without requiring additional capital. This is simply a cause and effect of overly restrictive leverage capital.\nThe fact of leverage ratios becoming increasingly binding is evident in simple metrics like the ratio of risk-weighted assets to total leverage exposure. These are, respectively, the denominators of risk-based capital ratios and the SLR. Shortly after the SLR was adopted in the U.S. in the mid-2010s, this ratio stood at 48 percent in the aggregate for the eight largest U.S. banks, the global systemically important banks (G-SIBs). Since then, the ratio of risk-weighted assets to total leverage exposure has declined and currently stands at 40 percent, primarily due to higher reserves and other types of high-quality liquid assets on bank balance sheets. This downward trend results in the SLR increasingly becoming the binding constraint and reflects banks' growing holdings of high-quality liquid assets, most of which carry a risk weight of zero underrisk-basedcapital ratios but have a 100 percent weighting underleveragecapital ratios.\nEfficient SolutionsOne example of the SLR's unintended consequence is the erosion of liquidity in U.S. Treasury markets because it is driven, in part, by leverage ratio requirements increasingly becoming the binding constraints on the largest U.S. banks. This example also illustrates the necessity of evaluating tradeoffs in regulation and speaks to a larger issue with the calibration of leverage.\nThe banking regulators are uniquely positioned to both analyze and remediate components of the bank regulatory framework that may disrupt banks' participation in low-risk, but economically critical activities. This includes the exacerbation of Treasury market illiquidity. Treasury markets play a critical role in the U.S. and global financial systems, and we should be proactive in addressing the unintended consequences of bank regulation, while ensuring the framework continues to promote safety, soundness, and financial stability.11We should start by addressing potential constraints on Treasury market functioning before issues arise, lessening impacts from stress, and mitigating the need to intervene in future market events.\nOn Wednesday, the Board is scheduled to consider specific amendments to the eSLR, which is the requirement that applies at both the holding company and bank levels of the largest U.S. banks. While I do not want to front-run the proposal, I will note that the proposal's goal is to address a long-identified—and growing—problem with the calibration of this leverage requirement. The proposal would solicit public comment on the impacts of this miscalibration, potential fixes, and work to develop an appropriate and effective solution. This proposal takes a first step toward what I view as long overdue follow-up to review and reform what have become distorted capital requirements. This proposal, while meaningful, addresses only one element of the capital framework. More work on capital requirements remains, especially to consider how they have evolved and whether changes in market conditions have revealed issues that should be addressed.\nIn a few weeks, on July 22, the Federal Reserve will host a conference to bring together a wide range of thought leaders to discuss the U.S. bank capital framework, including the design and calibration of leverage ratios. Fixing the design and calibration of leverage capital requirements will not resolve every issue with U.S. Treasury market functioning. But, simple reforms to return leverage ratio requirements to their traditional role as a capital backstop could improve Treasury market functioning by building resilience in advance of future stress events. And this could reduce the chances that we would need to intervene in Treasury markets should a future stress event arise. While we know well the issues created by the eSLR, there are many potential improvements that could address other issues within the capital framework.\nAs I have noted previously, a broader set of reforms could include amending not only the leverage capital ratio, but also G-SIB surcharge requirements. We should also reconsider capital requirements for a wider range of banks, including the SLR's application to banks with more than $250 billion in assets, Tier 1 leverage requirements, and the calibration of the community bank leverage ratio.\nThe unintended shift over time in the eSLR increasingly becoming a binding capital constraint demonstrates that we need to think about regulatory policies in a dynamic way based on the evolution in the banking and financial systems, and the broader economy.\nOther examples of regulations that must take into account the impact of economic growth and inflation include elements of the G-SIB surcharge, as well as regulatory thresholds that define the broader categories of banks. Thresholds like the $10 billion definition of a \"community bank\" and the $700 billion in total assets and $75 billion for cross-jurisdictional activity separating Category II and III banks determine which regulatory requirements apply to each group.\nOne way to prevent the original calibration from becoming divorced from the foundational policy decisions over time is to index the relevant G-SIB surcharge coefficients and regulatory thresholds to nominal gross domestic product. While approaches like indexing thresholds and requirements can make our regulations more robust and durable over time, we should also acknowledge the essential role of supervision as a tool to promote safety and soundness, and financial stability. Just as our capital requirements are intended to operate in a complementary manner, so do regulation and supervision act in a complementary way.\nThese are only a handful of relevant examples, but they are representative of an effective approach to regulatory reform. Regulations should not be created in a static world of \"set it and forget it.\" The economy evolves over time, as do the banking and financial systems and the needs of businesses and consumers.\nIncreasingly, regulators are expected to conduct a more thorough and detailed analysis as part of the ordinary rulemaking process, which includes a proposal's costs and benefits. Yet, over time, we tend to devote fewer resources to the work of conducting maintenance of our regulations. Maintenance of the regulatory system should include reviewing the basis for earlier policy decisions, considering whether the policies embedded in regulations have been distorted over time through market developments, and examining whether emerging issues in the market should lead to further review and revision.\nClosing ThoughtsThank you for the opportunity to join you today and to provide my views on the U.S. economic outlook and current regulatory proposals. In the United States, regulatory policy objectives are prescribed by law, and bank regulators focus primarily on promoting the safe and sound operation of U.S. banks, and financial stability. Despite this limited purpose, we must understand the consequences of regulations, which can extend well beyond the banking system. Recent trends—including providing more fact-based and analytical support for proposals—are a positive step in achieving responsible regulation.\nBut we need a broad commitment to follow the approach I have just described. We must consider relevant data and information, identify the source of any problems or opportunity for greater efficiency, and then develop targeted and effective policy solutions and approaches.\n1. The views expressed here are my own and are not necessarily those of my colleagues on the Federal Reserve Board or the Federal Open Market Committee.Return to text\n2. See 12 CFR 249.3; 249.20 (defining categories of high-quality liquid assets based on asset characteristics).Return to text\n3. See Michelle W. Bowman, \"Taking a Fresh Look at Supervision and Regulation (PDF),\" (speech at the Georgetown University McDonough School of Business, Psaros Center for Financial Markets Policy, Washington, D.C., June 6, 2025).Return to text\n4. Board of Governors of the Federal Reserve System, \"Federal Reserve Board Announces that the Temporary Change to its Supplementary Leverage Ratio (SLR) for Bank Holding Companies Will Expire as Scheduled on March 31,\" press release, March 19, 2021, (\"To ensure that the SLR—which was established in 2014 as an additional capital requirement—remains effective in an environment of higher reserves, the Board will soon be inviting public comment on several potential SLR modifications. The proposal and comments will contribute to ongoing discussions with the Department of the Treasury and other regulators on future work to ensure the resiliency of the Treasury market.\").Return to text\n5. See Board of Governors of the Federal Reserve System,Financial Stability Report (PDF)(Washington, D.C., April 2025), 10–11.Return to text\n6. Board of Governors,Financial Stability Report, at 32.Return to text\n7. See Board of Governors,Financial Stability Report, at 3.Return to text\n8. See Office of the Comptroller of the Currency and Federal Reserve System (2018), \"Regulatory Capital Rules: Regulatory Capital, Enhanced Supplementary Leverage Ratio Standards for U.S. Global Systemically Important Bank Holding Companies and Certain of Their Subsidiary Insured Depository Institutions; Total Loss-Absorbing Capacity Requirements for U.S. Global Systemically Important Bank Holding Companies,\"FederalRegister,vol. 83 (April 19), pp. 17317–27.Return to text\n9. See Office of the Comptroller of the Currency and Federal Reserve System (2018), \"II. Revisions to the Enhanced Supplementary Leverage Ratio Standards,\"Federal Register, vol. 83 (April 19), p. 17319, paragraph 3: \"Leverage capital requirements should generally act as a backstop to the risk-based requirements. If a leverage ratio is calibrated at a level that makes it generally a binding constraint through the economic and credit cycle, it can create incentives for firms to reduce participation in or increase costs for low-risk, low-return businesses.\"Return to text\n10. See, for example, Federal Reserve System (2020), \"Temporary Exclusion of U.S. Treasury Securities and Deposits at Federal Reserve Banks from the Supplementary Leverage Ratio (PDF),\"FederalRegister,vol. 85, (April 14), pp. 20578–79.Return to text\n11. For more information, see the press release in note 4 indicating that the Board would seek comment on changes to the SLR.Return to text"
    },
    {
      "title": "Taking a Fresh Look at Supervision and Regulation",
      "date": "2025-06-06T00:00:00",
      "location": "At the Georgetown University McDonough School of Business Psaros Center for Financial Markets and Policy, Washington, D.C.",
      "url": "https://www.federalreserve.gov/newsevents/speech/bowman20250606a.htm",
      "content": "It is a pleasure to join you today for my first public remarks as the Federal Reserve Board's Vice Chair for Supervision.1Today, I will describe my approach to leading the Fed's Division of Supervision and Regulation in its vital work to promote the safe and sound operation of the U.S. banking system. I have spoken extensively in the past about my principles for supervision and regulation, which will continue to guide my approach to supervision and the bank regulatory framework.2\nAt the core of these principles is pragmatism, which focuses on first identifying the problem to be solved and then developing efficient solutions.3Once we have identified a need for reform, or a problem to be solved, our next task is to conduct a careful analysis of the intended and unintended consequences of any proposed policy solution, and to consider alternative approaches that lead to lower cost or better outcomes.\nThe views I share with you today reflect my initial thoughts about how these principles should be incorporated into the important work that will be required to improve supervision and regulation in the future, addressing: (i) enhancing supervision to more effectively and efficiently meet the Fed's safety and soundness goals; (ii) reviewing and reforming the capital framework to ensure that it is appropriately designed and calibrated; (iii) reviewing regulations and information collections to ensure that this framework remains viable; and (iv) considering approaches to ensure the applications process is transparent, predictable, and fair.\nEnhancing SupervisionSupervision focused on material financial risks that threaten a bank's safety and soundness is inherently more effective and efficient. We should be cautious about the temptation to overemphasize or become distracted by relatively less important procedural and documentation shortcomings. Fundamentally, as I've noted in the past, our goal should be to prioritize the identification of material financial risks and encourage prompt action to mitigate risks that threaten safety and soundness. There are a number of changes we can adopt in the near term to better enable us to accomplish this goal:\nTailoring.Risks are not uniform, and each bank is unique based on its business model, complexity, and business profile. I am a long-time proponent of tailoring banking regulations. Going forward we will extend the application of tailoring to our supervisory approach to financial institutions, not only among bank categories, but also within a particular category.\nIn the past, the Board has \"pushed down\" requirements developed for the largest firms to smaller banks, often including regional and community banks. One approach that would preserve tailoring is to create an independent community bank supervisory and regulatory framework to clearly separate these banks from larger bank supervision and regulation. This would serve to insulate these smaller banks from standards designed for larger and more complex firms. While I have no objection to a deliberate, intentional policy to apply similar standards to firms with similar characteristics as conditions warrant, the gradual erosion of distinct regulatory and supervisory standards among firms with very different characteristics—essentially the subtle reversal of tailoring over time—is not a reasonable approach for implementing supervision and regulation.\nBoth regulators and legislators should consider whether the bank regulatory framework includes appropriate thresholds for defining distinct categories of institutions, and whether simple fixes—for example the indexing of thresholds to inflation or growth—could better ensure a sound, tailored approach that remains durable over time. It is clear that the current $10 billion threshold defining the upper bounds of a \"community bank\" leaves many institutions that pursue this business model—of community and relationship-based banking—subject to heightened requirements more suitable for larger and more complex firms.\nTo further these objectives, later this year I will host a conference on small and community bank issues, to discuss improving the bank regulatory framework to adopt a more efficient, tailored approach for these firms. We must demonstrate wisdom and courage by carefully listening to those who are subject to regulatory oversight and considering ways to enhance our approaches to both supervision and regulation.\nOne issue that continues to present challenges to smaller banks is check fraud. The ongoing increase in bank losses to this type of fraud can negatively impact the perceived safety of the banking system and result in significant consumer harm. Past efforts by regulators have been frustratingly slow to advance and seem to have done little to address the underlying root causes of this increase in fraud. I will continue to work to identify specific actions that can be taken to reduce the incidence of fraud, including through expediting the remediation process from check fraud after it occurs. I expect that the Federal Reserve, in coordination with the OCC and FDIC, will soon take action on this front.\nRatings. Ratings must reflect risk, and yet we have seen gradual changes in supervisory approaches that have eroded the link between ratings and financial condition.4Federal Reserve supervisory statistics show that that two-thirds of the largest financial institutions in the U.S. were rated unsatisfactory in the first half of 2024.5At the same time, the majority of these same institutions met all supervisory expectations for capital and liquidity.\nThis odd mismatch between financial condition and supervisory ratings requires careful review and appropriate revisions to our current approach. Under the current large bank ratings framework, a single component rating can result in a firm being considered not \"well-managed,\" which has driven the disparity between well-managed status and financial condition.\nThe Federal Reserve will soon begin to address this mismatch, by proposing changes to the Large Financial Institution ratings framework. The proposed changes will be designed to result in a more sensible approach to determining whether a firm is well-managed, no longer disproportionately weighting a single framework component for a firm that has demonstrated resilience under a range of conditions and stresses.\nThis initial change should help address the gap between assessed ratings and material financial risk for those firms subject to this framework. We have an obligation to ensure that our supervisory ratings are current, credible, and reflect material financial risk. This promotes effective supervision and ensures that firms are accurately rated based on their underlying financial strength, which should increase the public's confidence in our assessment of the banking system.\nWe must also consider the appropriateness of the broader ratings framework which applies to smaller institutions, including the CAMELS framework. Are these frameworks appropriately tailored to capture material financial risks, particularly for elements that rely on subjective examiner judgment? While judgment is a legitimate and necessary tool in supervision, it must always be grounded in the materiality of the identified issues as they relate to the financial health of each institution and the banking system as a whole. This has been a notable shift in supervision not only for large banks, but also for regional and community banks.\nImproving prioritization.Examiners review a broad range of activities in the supervisory process. A random sample of examination reports demonstrates that supervisory focus has shifted away from core financial risks (credit risk, interest rate risk, and liquidity risk, for example), to process-related concerns. While process is important for effective management, there is a risk that overemphasis on process and supervisory box-checking can be a distraction from the core purpose of supervision, which is to probe financial condition and financial risk. Checklists should not distract examiners from the central purpose of examinations.\nAnother tool that we will be reviewing with a critical lens is the use of horizontal reviews. In theory, horizontal reviews—where examiners conduct a narrow but deep review on a particular topic across multiple banks—can help improve an examiner's perspective. Horizontal reviews, when used effectively, can help supervisors better understand the range of industry practices.\nBut these reviews have quickly evolved into oversimplification of complex issues and often include \"grading on a curve,\" where firms are rank-ordered, with an expectation that implementing a simpler approach fails to meet expectations, under the assumption that the more complex approach is appropriate for all firms. However, this side-by-side comparison fails to address the only question that matters: whether a firm's approach meets appropriate legal and supervisory standards for the individual firm's characteristics. Differences in approaches are not indicative of shortcomings, particularly since these can often be explained by distinguishing the underlying activities, scope and scale of operations, and risk tolerance of the firm's board and management.\nThere is also a lack of transparency in the results of these exams, and a risk that horizontal reviews will create generally applicable rules without complying with the Administrative Procedure Act (APA). I will be looking closely at whether the continued use of horizontal exams going forward is appropriate, and if so, to ensure that these exams are sufficiently transparent, they reflect proper respect for the APA, and do not circumvent our responsibility to provide each regulated institution with a fair, firm-specific evaluation.\nThe role of guidance in supervision.Finally, I will discuss the important role of guidance in the supervisory process. Guidance can be an effective tool to promote transparency in supervisory expectations, to provide clarity to regulated institutions on the permissibility of new activities and their associated risks, and to provide firms some perspective on how they may comply with statutory and regulatory requirements. Structured with these goals in mind, guidance can further the objective of supervisory prioritization.\nWhere guidance does not further these objectives, it is worth revisiting. I think it is important that we review a wide range of existing guidance, including outstanding Supervision and Regulation Letters (SR Letters), topical guidance that addresses issues that may adversely affect innovation (like the extensive guidance that has some bearing on third-party risk management), and the many other guidance documents that have been issued in recent years.\nFundamentally, guidance should clarify expectations, and provide answers to industry questions, such as our earlier \"office hours\" guidance that provided a venue for banks and innovators to share information on new products and services like digital asset activities and artificial intelligence.\nChanging expectations around the use of guidance, as a tool to promote clarity in supervisory expectations, can encourage innovation in the banking system. Uncertainty in supervisory expectations has long been an obstacle to banks seeking to innovate, including banks engaging in digital asset activities or incorporating new technologies like artificial intelligence to improve efficiency and delivery of products and services. Just as it is imperative that banks innovate to remain competitive in the future, it is critical that bank supervisors enable the adoption of new technologies in a manner consistent with safety and soundness.\nExaminer training and workforce development.Examiners must engage in a challenging course of study and pass rigorous tests before qualifying to become a commissioned bank examiner. Those who have obtained this license have a strong foundation that they can rely on to conduct appropriate examinations. The commission demonstrates an elevated level of expertise, judgment, and fairness that these examiners bring to their work. As such, they should not shy away from transparency or public accountability.\nCurrently, the Federal Reserve does not require all staff involved in supervision and bank examination to have met or to be on a path to meet this credential. Regulated entities should be able to expect that all of our examination and supervisory teams have achieved or are working to achieve this level of professional expertise. Going forward, the Fed will prioritize this training, particularly as we face an aging workforce across the Federal banking agencies that will require our new examination staff to ensure the safety and soundness of the banking system into the future. Failure to invest in and plan for examiner training today will result in much less effective supervision in years to come.\nCapitalCapital requirements are an important component of the prudential regulatory framework and are essential for the stability of interconnected banking and financial systems around the world. Yet too often, our efforts to address capital reform take a piecemeal approach to capital requirements. We tend to review individual elements of the capital framework in isolation, without considering whether proposed changes are sensible in the aggregate and contribute to a capital framework in which all components work together effectively.\nWhile each component is important, the aggregate calibration of requirements is ultimately the most meaningful, and we must examine whether this approach in totality appropriately captures risk. Over-calibrated capital requirements effectively create market distortions, disfavoring some activities over others in a way that is divorced from prudential safety and soundness goals and economic conditions.\nLeverage ratios are one example that illustrates this concern. The Federal Reserve has long acknowledged that leverage ratios are intended to act as a \"backstop\" to risk-based capital requirements. When leverage ratios become the binding capital constraint at an excessive level, they can create market distortions. This is especially true in the case of the enhanced supplementary leverage ratio (eSLR) which is applicable to the largest banks.\nAs a result of this leverage requirement, banks are less inclined to engage in low-risk activities like Treasury market intermediation and revise their business activities in a way that is neither justified nor responsive to their customer needs. These distortions can also create broader financial system impacts like increased stress on Treasury market functioning. To be clear, the increasing bindingness of the eSLR on the largest firms did not result from careful policy debate and discussion. Instead, it is an unintended consequence of market and other bank regulatory requirements implemented after it was originally put in place.\nThe original calibration of the eSLR was based on forecasts of the level of reserves and other so-called \"safe assets\" in the system that are now far out of line with current levels. I expect that in the near future, the agencies will publish a proposal to help address this concern and ensure that the eSLR resumes functioning as a backstop capital requirement.\nWhile this fix to the eSLR is necessary, it may not be sufficient to address issues in the capital framework. In July, the Federal Reserve will host a conference that will broaden our perspective in the consideration of capital requirements for large banks. We will bring together bankers, academics, and other capital experts to examine whether capital requirements as currently structured and calibrated are operating as intended—in a complementary fashion.\nI welcome the opportunity to consider a broader range of perspectives as we look to the future of capital framework reforms. In addition to considering potential changes to leverage ratio requirements and stress testing, the capital conference will also include a discussion of potential reforms to the GSIB surcharge and the Basel III capital requirements.\nThe Board has already proposed a significant change to reduce the volatility in capital requirements resulting from our current stress testing process. The proposal includes providing a longer implementation timeline to phase in the annual stress capital buffer requirement. And later this year, the Board will consider more extensive changes aimed at promoting transparency, fairness, and predictability in the stress testing program.\nWhile stress testing is an important supervisory tool, its implementation, outcomes, and processes have raised significant questions and concerns about its effectiveness in identifying systemic weakness. The lack of transparency around the models used in stress testing prevents meaningful discussions about how the stress tests can be improved.\nCapital has an impact on the business activities of all banks. Although the capital framework for the smallest institutions tends to be simpler and more straightforward, calibration and design elements play an important role in the functioning of smaller banks just as they do for larger banks. Therefore, it is important that we also take the opportunity to address issues for smaller banks, that provide critical support to their local communities and the economy. On this front, we will review and consider the community bank framework, including capital requirements like the calibration of the community bank leverage ratio, and whether reforms to the capital framework for mutual banks can be improved to promote capital formation.\nI look forward to the results of public engagement on these issues, including through the upcoming conferences. As we consider bank capital requirements, the focus should be on achieving a capital framework that provides a strong foundation for the banking system, appropriately requires banks to hold capital corresponding to risk, and works together with bank supervision to support a safe and sound banking system.\nReview of Regulations and Information CollectionsSince the passage of the Dodd-Frank Act nearly 15 years ago, the body of regulations that all banks are subject to has increased dramatically. Many of the reforms made after the 2008 financial crisis were important and essential to ensuring a stronger and more resilient banking system. Yet, a number of the changes were backward looking—responding only to that mortgage crisis—not fully considering the potential future unintended consequences or future states of the world.\nWith well over a decade of change in the banking system now behind us post-implementation, it is time to evaluate whether all of these changes continue to be relevant. Some of the regulations put in place immediately after that financial crisis resulted in pushing foundational banking activities out of the regulated banking system into the less regulated corners of the financial system. We need to ask whether this was and continues to be appropriate. These tradeoffs are complicated, and we must consider not only the changes that were made but also the evolution of and differences in the banking system today.\nDriving all risk out of the banking system is at odds with the fundamental nature of the business of banking. Banks must be able to earn a profit and grow while also managing their risks. Adding requirements that impose more costs must be balanced with whether the new requirements make the correct tradeoffs between safety and soundness and enabling banks to serve their customers and run their businesses. The task of policymakers and regulators isnotto eliminate risk from the banking system, but rather to ensure that risk is appropriately and effectively managed.\nIn a well-functioning, regulated banking system, banks serve an indispensable role in credit provision and economic stability. The goal is to create and maintain a system that supports safe and sound banking practices, and results in the implementation of proper risk management. Our goal should not be to prevent banks from failing or even eliminate the risk that they will. Our goal should be to make banks safe to fail, meaning that they can be allowed to fail without threatening to destabilize the rest of the banking system.\nMaintenance of the regulatory framework is necessary to ensure that our regulations continue to strike the right balance between encouraging growth and innovation, and safety and soundness. One easily identifiable way to achieve this is using the Economic Growth and Regulatory Paperwork Reduction Act (EGRPRA) review process, which the agencies initiated in February of last year.\nThe EGRPRA review process requires the federal banking agencies to identify any outdated, unnecessary, or overly burdensome regulations, eliminate unnecessary regulations, and take other steps to address the regulatory burdens associated with outdated or overly burdensome regulations. Prior iterations of the EGRPRA process have been underwhelming in their ability to result in meaningful change, but it is my expectation that this review, and eventually the accompanying report to Congress, will provide a meaningful process for stakeholders and the public to engage with the banking agencies in identifying regulations that are no longer necessary or are overly burdensome. It is also my expectation that regulators will be responsive to concerns raised by the public.\nAnother area that is ripe for review are several of the Board's rules that address core banking issues—from loans to insiders, to transactions with affiliates, to state member bank activities, and domestic and foreign activities of bank holding companies. Many of the Board's regulations have not been comprehensively reviewed or updated in more than 20 years. Given the dynamic nature of the banking system and how the economy and banking and financial services industries have evolved over that period, we should update and simplify many of the Board's regulations, including thresholds for applicability and benchmarks.\nBanking ApplicationsThe process to file an application and receive regulatory approval, whether it involves banks seeking ade novocharter, institutions seeking to merge, or any other application for bank regulatory approval should reflect both (1) transparency as to the information required in the application itself, and the standards of approval being applied, and (2) clear timelines for action.\nRecent experience with banking applications suggests that revisions would be helpful in this space. Streamlining the applications forde novoformation, and establishing clearer standards for approval, may encourage morede novoactivity.\nSimilar problems have affected bank mergers and acquisitions, where there have been lengthy processing delays. We need to rethink whether many of the additional requests for information can be addressed through better application forms or relying on information that is available from bank examinations. We should also consider factors that force applications to be moved from Reserve Bank-delegated processing to requiring consideration by the Board. One example is the perverse effect of \"competitive\" screens that disproportionately affect transactions in rural and underserved banking markets. Another is the treatment of adverse public comments that may lack factual support or rely on matters already considered in the review process, including existing supervisory records.\nClosing ThoughtsI am honored to have the opportunity to serve as the Vice Chair for Supervision. The work of supervision and regulation is critical to maintaining a safe and sound banking system and protecting U.S. financial stability. Conditions constantly evolve in the banking system, and so too must the regulatory and supervisory framework. We must be proactive and responsive in the face of emerging risks and ensure that the framework operates in an efficient and effective manner.\nThe steps I have identified today are intended to further these goals by creating an initial roadmap to refocus supervisory and regulatory efforts on the core financial risks most critical to maintaining a healthy and resilient banking system. I look forward to working with my Board colleagues and my counterparts at the other banking agencies as we pursue sensible and pragmatic reforms.\n1. The views expressed here are my own and are not necessarily those of my colleagues on the Federal Reserve Board or the Federal Open Market Committee.Return to text\n2. See, e.g., Michelle W. Bowman, \"Bank Regulation in 2025 and Beyond\" (speech at the Kansas Bankers Association Government Relations Conference, Topeka, KS, February 5, 2025); Michelle W. Bowman, \"Innovation in the Financial System\" (speech at the Salzburg Global Seminar on Financial Technology Innovation, Social Impact, and Regulation: Do We Need New Paradigms?, Salzburg, Austria, June 17, 2024); Michelle W. Bowman, \"Tailoring, Fidelity to the Rule of Law, and Unintended Consequences (PDF)\" (speech at the Harvard Law School Faculty Club, Cambridge, MA, March 5, 2024); Michelle W. Bowman, \"New Year's Resolutions for Bank Regulatory Policymakers\" (speech at the South Carolina Bankers Association 2024 Community Bankers Conference, Columbia, SC, January 8, 2024).Return to text\n3. Michelle W. Bowman, \"Approaching Policymaking Pragmatically (PDF)\" (remarks to the Forum Club of the Palm Beaches, West Palm Beach, FL, November 20, 2024).Return to text\n4. See Board of Governors of the Federal Reserve System,Supervision and Regulation Report(PDF)at 16-17 (Washington: Board of Governors, November 2024), (describing data for the first half of 2024, the most recent period for which data is available).Return to text\n5. Board of Governors of the Federal Reserve System,Supervision and Regulation Report.Return to text"
    }
  ]
}