[
  {
    "text": "Northrup Grumman Aeronautics Systems, Oklahoma City, Oklahoma, was awarded a $495,000,000 requirements contract for technical representative engineering services. This contract provides for engineering services that support various major defense programs. Work will be performed at Oklahoma City, Oklahoma and is expected to be completed by July 22, 2030. This contract was a sole source acquisition. No funds are being obligated at the time of the award. The Air Force Sustainment Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8109-25-D-B002).",
    "contract_date": "2025-07-23"
  },
  {
    "text": "L3Harris, Camden, New Jersey, has been awarded a maximum $29,292,939 modification (P00016) to a previously awarded contract (FA8213-19-D-0006) for Cockpit Selectable Height of Burst Sensor. The modification brings the total cumulative face value of the contract to $161,073,128 from $131,780,189. Work will be performed at Cincinnati, Ohio, and is expected to be completed by August 2029. Fiscal 2024 aircraft procurement funds in the amount of $11,094,818 are being obligated at time of award. The Air Force Life Cycle Management Center, Hill Air Force Base, Utah, is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "Cubic Defense Applications, Inc., San Diego, California, was awarded a $17,987,522 cost-plus-fixed-fee, completion contract for Halo advanced networking satellite communication elements. This contract provides for the refinement and development the detailed system design of an ultra-low size, weight, and power flat panel active electronically scanned array with full 2D beam steering that maximizes flexible connectivity. Work will be performed at San Diego, California, and is expected to be complete by July 22, 2027. This contract was a competitive acquisition and 2 offers were received. Fiscal 2025 research, development, test and evaluation funds in the amount of $17,987,522 are being obligated at the time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-C-B035).",
    "contract_date": "2025-07-23"
  },
  {
    "text": "HII Fleet Support Group LLC, Virginia Beach, Virginia (N00189-25-D-Z022); Chitra Productions LLC,* Virginia Beach, Virginia (N00189-25-D-Z023); Carley Corp., Orlando, Florida (N00189-25-D-Z024); Transtecs Corp.,* Wichita, Kansas (N00189-25-D-Z025); C2 Technologies Inc., McLean, Virginia (N00189-25-D-Z026); JANUS Research Group LLC, Evans, Georgia (N00189-25-D-Z027); and Crew Training International Inc., Memphis, Tennessee (N00189-25-D-Z028), are being awarded an estimated $218,181,818 indefinite-delivery/indefinite-quantity multiple award contract. The contract will include terms and conditions for the placement of firm-fixed-price and cost-plus-fixed-fee task orders to provide curriculum planning, analysis, maintenance, and development as well as PC modeling, simulation, and the creation of part task trainers in support of Naval Education Training Command's Naval Training Products and Services program. The contracts run concurrently. The contract will include a 60-month base ordering period with an additional six-month option period pursuant to Federal Acquisition Regulation (FAR) 52.217-8. The total estimated value of the contracts combined will have a ceiling value of $240,000,000 if the six-month option is exercised. Work is expected to begin August 2025 and be completed by July 2030; if the option is exercised, work will be completed by January 2031. Work will be performed in Virginia Beach, Virginia; Orlando, Florida; Wichita, Kansas; McLean, Virginia; Evans, Georgia; and Memphis, Tennessee. The percentage of work for each contract cannot be determined at this time. Fiscal 2025 operation and maintenance funds (Navy) in the contracts' minimum amount of $35,000 ($5,000 each) will be obligated at the time of award and funds will expire at the end of fiscal year. Subsequent task orders under the resultant contract will be funded with appropriate fiscal year operations and maintenance funds. This contract was competitively procured through the System for Award Management website pursuant to FAR 16.504 and FAR Part 15 with 31 offers received. Naval Supply Systems Command Fleet Logistics Center Norfolk, Pentagon Directorate, Philadelphia, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "GPA Technologies Inc., San Diego, California (N00024-25-D-4141); Oceanetics Inc., Fredericksburg, Virginia (N00024-25-D-4142); PCCI Inc., Alexandria, Virginia (N00024-25-D-4143); and Virtual Computing Technology Inc., Arlington, Virginia (N00024-25-D-4144), are awarded a combined $199,000,000 firm-fixed-price/cost-plus-fixed fee, indefinite-delivery/indefinite-quantity contract for the sustainment and refurbishment of waterborne security barriers (WSB), moorings, and marine facilities. This procurement provides logistical support, fabrication, installation, inspection, refurbishment, development, and field supervision/operation of waterfront barriers, associated moorings, WSBs, and related marine facilities worldwide. The contract supports the WSB, moorings, and WSB product lines. Each awardee will be awarded $1,000 (minimum contract guarantee per awardee) at contract award. These contracts include options which, if exercised, would bring the cumulative value to $199,000,000 over a ten-year period for the four vendors combined. Work will be performed worldwide and is expected to be completed by July 2030. If all options are exercised, work will continue through July 2035. Fiscal 2025 other procurement (Navy) funding in the amount of $4,000 will be obligated at the time of award and will not expire at the end of the current fiscal year. All other funding will be made available at the delivery order level as contracting actions occur. This contract was competitively procured via the Procurement Integrated Enterprise Environment Solicitation Module, with four offers received. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "Raytheon Co., Tucson, Arizona, is awarded a $51,901,614 modification to a previously awarded cost-plus-fixed-fee, cost-only and firm-fixed-price indefinite-delivery/indefinite-quantity contract (M67854-21-D-0073) for the production and delivery of full rate production Stinger Air-to-Air Launchers, ancillary support equipment training, associated engineering services for integration activities, and parts obsolescence management and engineering services to identify, track, design and source replacement parts as required to resolve obsolescence issues in support of the Program Manager Ground Based Air Defense, Marine Air Defense Integrated System. The cumulative value of the contract is $96,250,000. Work will be performance in Tucson, Arizona (66%); and Diné, New Mexico (34%), with an expected completion date of September 2026. No funds will be obligated at time of award. Funds will be obligated on individual task and delivery orders as they are issued. This contract was a sole source acquisition pursuant to Federal Acquisition Regulation 6.302-1. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-21-D-0073 P00015).",
    "contract_date": "2025-07-23"
  },
  {
    "text": "General Dynamics Electric Boat Corp., Groton, Connecticut, is awarded a $33,541,728 cost-plus-fixed-fee modification to a previously awarded contract (N00024-23-C-4307) to exercise options for continued Nuclear Regional Maintenance Department support at Naval Submarine Support Facility New London. Work will be performed in Groton, Connecticut, and is expected to be completed by August 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $24,000,000 will be obligated at time of award and will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "Aviation Systems Engineering Co. Inc., Lexington Park, Maryland, is awarded a $15,341,242 firm-fixed-price modification (P00001) to contract N0001925C0113. This modification is exercising contract line items for continued support of  training efforts for the German Navy in both maintenance functions and flight operations for the P-8A Poseidon aircraft to assist German P-8A squadrons in achieving European military airworthiness requirements for aircraft maintainer various rates; as well as teach maintenance practices for conventional weapon loading and fiber optic wiring, teach P-8A pilots and aircrew, support the German Navy in maintaining pilot and aircrew proficiency and completing Naval Air Training and Operating Procedure Standardization check rides as well as emergency procedure check rides for the German Navy. Work will be performed in Jacksonville, Florida (50%); Nordholz, Germany (40%); and Berlin, Germany (10%), and is expected to be completed in May 2030. Foreign Military Sales funds in the amount of $7,741,22 will be obligated at time of award, none of which will expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "Huntington Ingalls Industries Fleet Support Group LLC, Virginia Beach, Virginia, was awarded an $8,429,649 delivery order off indefinite-delivery/indefinite-quantity contract (N00024-21-D-4114) for engineering, technical, repair, and logistic support to Commander, Naval Surface Force, U.S. Pacific Fleet; U.S. Naval Ship Repair Facility and Japan Regional Maintenance Center (JRMC) Yokosuka, Detachment Sasebo; and ships' force personnel in the execution of hull, mechanical, and electrical maintenance and maintenance training services. Work will be performed at JRMC Yokosuka and is expected to be completed by July 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $8,429,649 was obligated at the time of award and will expire at the end of the current fiscal year. The overall total contract value ceiling remains unchanged on the basic contract at $272,977,437. Southwest Regional Maintenance Center, San Diego, California, is the contracting activity (N55236-25-F-9968).  (Awarded July 22, 2025)",
    "contract_date": "2025-07-23"
  },
  {
    "text": "L3 Technologies Inc., Camden, New Jersey, was awarded a $7,646,030 firm-fixed-price and cost-plus award fee modification to previously awarded contract (N00024-22-C-5218) to exercise options for the AN/USG 2B System and Spares. Work will be performed in Largo, Florida (69%); Salt Lake City, Utah (28%); and Lititz, Pennsylvania (3%), and is expected to be completed by August 2026. Fiscal 2025 research, development, test, and evaluation (Navy) funds in the amount of $3,117,917 (40%); fiscal 2025 ship construction (Navy) funds in the amount of $2,120,643 (28%); fiscal 2025 Navy working capital fund (Navy) funds in the amount of $1,518,034 (20%); fiscal 2025 other procurement (Navy) funds in the amount of $813,377 (11%); and fiscal 2017 ship construction (Navy) funds in the amount of $76,059 (1%), were obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-23"
  },
  {
    "text": "Manson Construction Co., Seattle, Washington, was awarded a $39,050,000 firm-fixed-price contract for a self-propelled trailing suction type hopper dredge. Bids were solicited via the internet with two received. Work will be performed in Venice, Louisiana, with an estimated completion date of Nov. 23, 2026. Fiscal 2025 operation and maintenance, Army and civil Corps of Engineer funds in the amount of $39,050,000 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans, Louisiana, is the contracting activity (W912P8-25-C-0019).",
    "contract_date": "2025-07-23"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-23"
  }
]