[
  {
    "text": "Longbow LLC, Orlando, Florida, was awarded a $348,312,758 modification (P00002) to contract W58RGZ-25-C-0001 for fire control radar systems. Work will be performed in Orlando, Florida, with an estimated completion date of Sept. 30, 2025. Fiscal 2025 Foreign Military Sales funds in the amount of $348,312,758 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "ASRC Builders-Caddell LLC, Anchorage, Alaska, was awarded a $290,322,700 firm-fixed-price contract for construction of the Joint Integrated Test and Training Center flight simulator training facility. Bids were solicited via the internet with two received. Work will be performed on Joint Base Elmendorf Richardson, Alaska, with an estimated completion date of July 18, 2025. Fiscal 2025 military construction funds in the amount of $110,962,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Joint Base Elmendorf-Richardson, Alaska, is the contracting activity (W911KB-25-C-A005).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Sig Sauer Inc., Newington, New Hampshire, was awarded a $95,245,084 firm-fixed-price contract for the commercial spare parts for machine guns, special tools, and gauges. Bids were solicited via the internet with one received. Work will be performed in Epping, New Hampshire, with an estimated completion date of Apr. 18, 2026. Fiscal 2025 Foreign Military Sales funds in the amount of $95,245,084 were obligated at the time of the award. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-25-C-0021).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "C.J. Mahan Construction Co. LLC, Urbancrest, Ohio, was awarded a $26,306,940 firm-fixed-price contract for restoration of Holt Lock Monolith. Bids were solicited via the internet with two received. Work will be performed in Tuscaloosa, Alabama, with an estimated completion date of April 14, 2026. Fiscal 2025 civil construction funds in the amount of $26,306,940 were obligated at the time of the award. U.S. Army Corps of Engineers, Mobile, Alabama, is the contracting activity (W91278-25-C-A004).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "GSE Construction Co. Inc., Livermore, California, was awarded a $9,741,900 firm-fixed-price contract for wastewater treatment plant repairs. Bids were solicited via the internet with three received. Work will be performed in Tracy, California, with an estimated completion date of Jan. 9, 2027. Fiscal 2025 operation and maintenance funds in the amount of $9,741,900 were obligated at the time of the award. U.S. Army Corps of Engineers, Sacramento, California, is the contracting activity (W91238-25-C-A001).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "BAE Systems Land and Armaments L.P., York, Pennsylvania, was awarded a $9,000,000 modification (P00003) to contract W912CH-24-C-0037 for technical inspections and to convert Bradley vehicles to be fully mission capable. Work will be performed in York, Pennsylvania, with an estimated completion date of July 10, 2026. Fiscal 2025 Security Assistance Initiative funds in the amount of $9,000,000 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Michels Construction Inc., Brownsville, Wisconsin, was awarded a $7,691,140 firm-fixed-price contract for a power charging system at Caven Point Marine Terminal. Bids were solicited via the internet with seven received. Work will be performed in Jersey City, New Jersey, with an estimated completion date of June 30, 2026. Fiscal 2025 operation and maintenance, Army funds in the amount of $7,691,140 were obligated at the time of the award. U.S. Army Corps of Engineers, New York, New York, is the contracting activity (W912DS-25-C-0008).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Science Applications International Corp., Reston, Virginia, is awarded a $63,825,763 cost-plus-fixed-fee and firm-fixed-price indefinite-delivery/indefinite-quantity contract for warhead expansion boxes and the associated cable kits. This is a 78-month contract with no option periods. The ordering period end date is January 2032. Work will be performed in Bedford, Indiana (42%); Middletown, Rhode Island (32%); Indianapolis, Indiana (20%); Charleston, South Carolina (6%), and is expected to be completed by January 2032. Fiscal 2025 weapons procurement (Navy) funds in the amount of $1,001,642 will be obligated on the first task order immediately following award of the basic contract and will not expire at the end of the current fiscal year. This contract was competitively procured via SAM.gov, with 2 offers received. Naval Undersea Warfare Center Division, Newport, Newport, Rhode Island, is the contracting activity (N66604-25-D-T500).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Dynetics Technical Solutions, Huntsville, Alabama, is awarded a $8,441,591 firm-fixed-price and cost-plus-fixed-fee, term, indefinite-delivery/indefinite-quantity contract (N00167-25-D-0007) for Virginia-class submarine electron beam welding follow-on. Work will be performed in Huntsville, Alabama, with an ordering period up to five years from the date of the award and will not expire at the end of the current fiscal year. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $310,104 (3%) will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured under the authority of 10 U.S. Code 3204(a)(1), as implemented by Federal Acquisition Regulation 6.302-1. Naval Surface Warfare Center Carderock Division, West Bethesda, Maryland, is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "General Dynamics Information Technology Inc., Falls Church, Virginia, was awarded a $52,038,567 firm-fixed-price, level-of-effort, and cost reimbursable contract (H9227725FE011) under the Defense Intelligence Agency Solutions for Intelligence Analysis 3 indefinite-delivery/indefinite-quantity vehicle. This contract provided services and expertise to support Special Operations Command Central J2 Intelligence Directorate to enhance overall mission effectiveness. The period of performance includes a base year from Aug. 1, 2025, to Feb. 28, 2026, with four option years. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Cherokee Analytics LLC, Tulsa, Oklahoma, was awarded a $35,492,790 firm-fixed-price, level-of-effort, and cost reimbursable contract (H9227725FE010) under the Defense Intelligence Agency Solutions for Intelligence Analysis 3 indefinite-delivery/indefinite-quantity vehicle. This contract provided services and expertise to support Special Operations Command Central J3 Operations Directorate to enhance overall mission effectiveness. The period of performance includes a base year from Aug. 1, 2025, to Feb. 28, 2026, with four option years. U.S. Special Operations Command, MacDill Air Force Base, Florida, is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "General Dynamics Mission Systems, Inc., Scottsdale, Arizona, has been awarded a ceiling $34,273,921 modification (P00053) to a previously awarded contract (HQ0850-22-C-0007) for the Proliferated Warfighter Space Architecture Ground Management and Integration and Operation and Sustainment efforts. The modification brings the total cumulative face value of the contract to $ 1,106,722,296. Work will be performed at Scottsdale, Arizona; Huntsville, Alabama; and Grand Forks, North Dakota, and is expected to be completed by Sept. 30, 2029. Fiscal 2024 and 2025 research, development, test and evaluation funds in the amount of $738,697 are being obligated at time of award. The Space Development Agency, Washington, D.C., is the contracting activity. (Awarded July 17, 2025)",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Microlink Devices Inc., Niles, Illinois, was awarded a space technology advanced research effort ceiling $28,232,840 cost reimbursement contract for developing lightweight advanced space power. This contract provides for six projects supporting a diverse range of space technology development, building on MicroLink’s epitaxial lift-off inverted metamorphic multijunction solar cell technology. Work will be performed in Niles, Illinois, and is expected to be completed by July 17, 2029. Fiscal 2024 and 2025 research, development, test and evaluation funds in the amount of $5,285,000 are being obligated at the time of award. The Air Force Research Lab Space Technology Branch, Kirtland Air Force Base, New Mexico, is the contracting activity (FA9453-25-C-X021). (Awarded July 17, 2025)",
    "contract_date": "2025-07-18"
  },
  {
    "text": "General Dynamics Mission Systems Inc., Scottsdale, Arizona, has been awarded a not-to-exceed $20,000,000 modification (P00054) to a previously awarded contract (HQ0850-22-C-0007) for the Proliferated Warfighter Space Architecture Ground Management and Integration and Operation and Sustainment efforts. The modification brings the total cumulative face value of the contract to $1,126,722,296 from $1,106,722,296.  Work will be performed at Andøya Air Station and Ørland Air Station, Norway; and Kirtland Air Force Base, Albuquerque, New Mexico, and is expected to be completed by January 14, 2026.  Fiscal 2025 research, development, test and evaluation funds in the amount of $8,800,000 are being obligated at time of award. The Space Development Agency, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "LMI Consulting LLC, Tysons, Virginia, was awarded a firm-fixed-price, level-of-effort for labor, and time and materials for other directed cost and travel contract (HQ003425FE232). The amount of this action is $15,625,516. Fiscal 2025 operations and maintenance funds; and research, development, test and evaluation funds in the amount of $11,675,636, are being obligated at the time of the award. The cumulative total of the contract is $116,693,128. The total, if all options are exercised, is $116,693,128. The purpose of this contract is to provide professional support services and the capability to meet existing and emerging requirements through administrative, analytical, and strategic communication in support of the Office of the Under Secretary of Defense for Acquisition and Sustainment. LMI Consulting LLC will provide day-to-day administrative, analytical, program management and strategic communications support services. The work will be performed at the Pentagon; Mark Center, Alexandria, Virginia; and Crystal City, Virginia. The estimated contract completion date is July 22, 2030. Washington Headquarters Services, Arlington, Virginia, is the contracting agency.",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Northrop Grumman Systems Corp., Annapolis, Maryland, has been awarded a maximum $14,027,974 firm-fixed-price, definite-quantity contract for acoustic sonar baffles. This was a sole-source acquisition using U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1(a)(ii)(A). This is a three-year contract with no option periods. The performance completion date is Dec. 17, 2028. Using military service is Navy. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation at Richmond, Virginia (SPE4A5-25-C-0040).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "Infinity Fabrication, Marysville, Washington, has been awarded a maximum $9,999,999 firm-fixed-price, indefinite-quantity contract for B-52 aircraft engine hanger beams. This was a competitive acquisition with two responses received. This is a five-year contract with no option periods. The performance completion date is July 17, 2030. Using military service is Air Force. Type of appropriation is fiscal 2025 through 2030 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Richmond, Virginia (SPE4A7-25-D-0297).",
    "contract_date": "2025-07-18"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-18"
  }
]