[
  {
    "text": "Toll Remote Logistics Pty. Ltd., Melbourne, Australia, is being awarded a $950,000,000 multiple award of firm-fixed-price, indefinite-delivery/indefinite-quantity contract to provide logistical capabilities which supports the six phases of the continuum of military operations in support of the Geographic Combatant Command’s joint operations, coalition partners, and other U.S. federal agencies in setting and sustaining the theater through the following requirements: theater opening (includes reception, staging, onward-movement, and integration support; sustainment; theater distribution; and stability operations and Defense Support of Civil Authorities support. The contract will run concurrently with the previously awarded contract and will include a five-year base performance period with one five-year option with individual requirements performed under task orders when specific dates and locations are identified. If the option period is exercised, the total estimated contract maximum for each contractor could be up to $1,900,000,000. The base period will begin August 2025 and is expected to be completed by December 2029; if all options are exercised, the performance period will be completed by December 2034. Work will be performed in twenty geographic regions: the Middle East; Bahrain; the United Arab Emirates; Africa; Eastern Europe and Western Asia; Western Europe; Mainland Asia; Japan; the Indian Ocean; Sri Lanka; Australia and Oceania; the Pacific Islands; Philippines; Indonesia; Malaysia and Singapore; Thailand; Vietnam; and Southeastern Asia. Due to the fact that the specific requirements cannot be predicted at this time, more specific information about the percentage and where the work will be performed cannot be currently provided. Fiscal 2025 operations and maintenance (Navy) (O&M,N) funds in the amount of $500, minimum, will be obligated and funds will not expire at the end of the current fiscal year. Additional funds will be obligated at the task order level with the appropriate fiscal year O&M,N funding as issued by the customers for each area of responsibility. The requirement was competitively procured with small business set aside for geographic regions within the U.S. and outlying territories, with 96 offers received. Naval Supply Systems Command, Headquarters, Mechanicsburg, Pennsylvania, is the contracting activity (N00023-25-D-0083).",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Vigor Marine, Portland, Oregon, is awarded a $42,592,765 firm-fixed-price contract (N3220525C4008) for a 130-calendar day shipyard availability for Military Sealift Command’s Fleet Replenishment Oiler USNS Earl Warren (T-AO 207). This contract includes a base work package and three unexercised options for additional work and time, which, if exercised, would increase the cumulative value of this contract to $43,813,594. Work will be performed in Portland, Oregon, beginning Oct. 15, 2025, and is expected to be completed by Feb. 22, 2026. Working capital funds (Navy) in the amount of $42,592,765 are obligated for fiscal 2025 and will not expire at the end of the fiscal year. This contract was competitively procured with proposals solicited via the Government Point of Entry website, and one proposal was received. Military Sealift Command, Norfolk, Virginia, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $33,355,000 modification (P00026) to a previously awarded cost-plus-incentive-fee contract (N0001921C0040). This modification increases the contract ceiling to provide cut in for Block 4 type vision effectivity development capability under the F-35 Joint Strike Fighter aircraft for Israel System Development and Design Phase II efforts to include software development and systems engineering. Work will be performed in Fort Worth, Texas (80%), and undisclosed locations outside the continental U.S. (20%), and is expected to be completed in July 2026. Foreign Military Sales customer funds in the amount of $7,661,140 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Lockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $28,328,040 cost-plus-fixed-fee, firm-fixed-price contract to provide integration activities for an F-35 Foreign Military Sales (FMS) customer including engineering support, program management, meetings, conferences, working groups, site support and activation, technical and financial support, information, and additional country-specific support. Work will be performed in Nagoya, Japan (52%); Fort Worth, Texas (29%); Tokyo, Japan (10%); various locations within Japan (5%); Orlando, Florida (3%); and various locations within the continental U.S. (1%), and is expected to be completed in May 2028. FMS customer funds in the amount of $28,328,040 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity (N0001925C0117).",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Seemann Composites LLC,* Gulfport, Mississippi, is awarded $12,610,993 firm-fixed-price modification to a previously awarded contract (N00024-24-C-2461) for production of composite components to LCAC 100 class craft. Work will be performed in Gulfport, Mississippi (76%); Horsham, Pennsylvania (24%), and is expected to be completed by June 2027. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $12,610,993 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Bell Boeing Joint Project Office, Amarillo, Texas, is awarded an $11,493,611 modification (P00021) to a firm-fixed-price order (N0001921F0030) against a previously issued basic ordering agreement (N0001917G0002). This modification settles a request for equitable adjustment resulting from Nacelle Improvements induction delays due to the availability of CV-22 aircraft. Work will be performed in Amarillo, Texas (53%); Bell Fort Worth, Texas (46%); and Boeing Ridley Park, Pennsylvania (1%), and is expected to be completed in February 2027. Fiscal 2023 aircraft procurement (Navy) funds in the amount of $11,493,611 will be obligated at the time of award, all of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "MPC Products Corp., Niles, Illinois, is being awarded a $9,817,200 contract for the repair for 150 control assemblies in support of the F-18 aircraft. The contract does not include options. All work will be performed in Niles, Illinois, and is expected to be completed by July 2026. Fiscal 2025 working capital (Navy) funds in the full amount of $9,817,200 will be obligated at time of award, and funds will not expire at the end of the current fiscal year. One company was solicited for this non-competitive requirement pursuant to the authority of 10 U.S. Code. 2304(c)(1) and one offer was received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity (N00383-25-C-B036).",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Ernst & Young LLP, New York, New York, is being awarded a modification to extend the existing labor-hour contract (HQ042321F0002) for financial statement audit services for the Navy and Marine Corps. The modification (P00027) is for a maximum face value of $69,389,290, bringing the total cumulative face value to $337,478,268 from $268,088,978. The modification is necessary to convert the Navy Working Capital Fund financial statement audit from a one-year to a two-year audit cycle, and provide an audit of the Navy General Fund and Marine Corps General Fund fiscal 2026 annual financial statements with an expected completion date of Dec. 31, 2026. This contract was the result of a competitive acquisition for which one quote was received. Fiscal 2025 Navy operations and maintenance funds in the amount of $18,900,921 will be obligated at time of award. Fiscal 2026 operations and maintenance funds in the amount of $50,488,369 are subject to availability and will be obligated when available. The Defense Finance and Accounting Service, Contract Services Directorate, Columbus, Ohio, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "M1 Support Services, Denton, Texas, has been awarded a $19,427,229 modification (P00139) to a previously awarded contract (FA4890-16-C-0012) for the T-38 Aircraft Maintenance Program. The modification will bring the total cumulative face value of the contract to $276,902,328. Work will be performed at Beale Air Force Base, California; Holloman AFB, New Mexico; Langley AFB, Virginia; and Whiteman AFB, Montana, and is expected to be completed by March 31, 2026. No funds will be obligated at time of award. The Air Combat Command Acquisition Management and Integration Center, Joint Base Langley-Eustis Air Force Base, Virginia, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "CACI, Inc-FEDERAL, Chantilly, Virginia, has been awarded a $10,007,000 modification (P00033) to a previously awarded contract (FA8821-24-F-B001) for implementation of the Phased Array Project for the Satellite Control Network. The modification brings the total cumulative face value of the contract to $392,608,522. Work will be performed in Colorado Springs, Colorado, and is expected to be completed by Jan. 22, 2027. Fiscal 2025 research, development, test and evaluation appropriations funding in the amount of $3,900,000 is being obligated at the time of modification award. The Space Systems Command, Peterson Space Force Base, Colorado, is the contracting activity.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "CORRECTION: The $44,155,395 contract (FA8210-25-F-B009) awarded to Cubic Defense Acquisition Inc., San Diego, California, on July 24, 2025, was announced with the incorrect date.  The correct date is July 25, 2025.",
    "contract_date": "2025-07-25"
  },
  {
    "text": "Russell Marine LLC, Channelview, Texas, was awarded a firm-fixed-price contract for the demolition of existing floodwall and construction of new floodwall. The amount of this action is $14,315,000 with a cumulative total face value of $14,315,000. Bids were solicited via the internet with two received. Work will be performed in Texas City, Texas, with an estimated completion date of May 10, 2027. Fiscal 2025 civil construction funds in the amount of $14,315,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Galveston, Texas, is the contracting activity (W912HY-25-C-0007).",
    "contract_date": "2025-07-25"
  },
  {
    "text": "CORRECTION: The modification announced on July 15, 2025, was announced with the wrong amount.  The correct total of the modifications is $775,000,000.  The program which allows for procurement of services was also announced incorrectly.  It should say Universal Services Contract-10 (U.S. Code 10).",
    "contract_date": "2025-07-25"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-25"
  }
]