[
  {
    "text": "F.K. Horn GmbH & Co.KG, Kaiserslautern, Germany (FA5613-25-D-0003); SKE Support Services GmbH, Goldbach, Germany (FA5613-25-D-0004); Wayss & Freytag Ingenieurbau AG, Frankfurt Am Main, Germany (FA5613-25-D-0005); J&J Maintenance Inc., doing business as J&J Worldwide Services, Mclean, Virginia (FA5613-25-D-0006); Wolff & Müller Government Services GmbH & Co. KG, Stuttgart, Germany (FA5613-25-D-0007); MICKAN Generalbaugesellschaft Amberg mbH& Co.KG, Amberg, Germany (FA5613-25-D-0008); and PORR Government Services GmbH, Kaiserslautern, Germany (FA5613-25-D-0009), were awarded a combined ceiling of $950,000,000 indefinite-delivery/indefinite-quantity, multiple-award construction contract for construction services. This contract provides for a streamlined execution method for a broad range of sustainment, maintenance, repair, alteration, renovation, and minor construction projects to include residential and commercial work for the Kaiserslautern military community and Spangdahlem Air Base areas. Work will be performed within the Federal Republic of Germany and is expected to be completed by July 21, 2034, if all options are exercised. These contracts were competitive acquisitions and seven offers were received. Fiscal 2025 operations and maintenance funds in the amount of $22,705 ($3,244 per awardee) are being obligated at time of award. The 700th Contracting Squadron, Kapaun Air Station, Germany, is the contracting activity.",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Deloitte & Touche LLP, Arlington, Virginia, was awarded a $25,009,233 firm-fixed-price contract for Secretary of the Air Force, Financial Management and Comptroller Chief, financial improvement and audit remediation services. This contract provides for day-to-day implementation of the financial improvement and audit readiness program and compliance with annual statements and audit mandates as required by the Chief Financial Officers Act of 1990 and the National Defense Authorization Act for fiscal 2024. Work will be performed in the National Capital Region and is expected to be completed by Nov. 30, 2025. This contract was a sole source acquisition. Fiscal 2025 Air Force operations and maintenance in the amount of $25,009,233 are being obligated at time of award. The Air Force District of Washington, Joint Base Andrews, Maryland, is the contracting activity (FA7014-25-F-0190).",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Mead & Hunt, Dlz, & Olsson JV, Middleton, Wisconsin (W912ES-25-D-A001); and HDR Bergmann JV, St. Louis Park, Minnesota (W912ES-25-D-A002); and Jacobs-AECOM-St. Paul A JV, Arlington, Virginia (W912ES-25-D-A003); and HNTB-Arcadis River Solutions JV, Kansas City, Missouri (W912ES-25-D-A004), will compete for each order of the $200,000,000 firm-fixed-price contract for architectural and engineering services. Bids were solicited via the internet with nine received. Work locations and funding will be determined with each order, with an estimated completion date of July 31, 2030. U.S. Army Corps of Engineers, St. Paul, Minnesota, is the contracting activity.",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Northrup Grumman Systems Corp., Melbourne, Florida, is awarded a $140,827,737 modification (P00110) to a previously awarded cost-plus-fixed-fee contract (N0001918C1037). This modification adds scope to provide non-recurring engineering efforts to support the production of five Japan configuration E-2D Advanced Hawkeye aircraft. This modification includes Foreign Military Sales (FMS) to Japan. Work will be performed in Melbourne, Florida (70%); Owego, New York (16%); Liverpool, New York (5%); Baltimore, Maryland (3%); Marlborough, Massachusetts (2%); Orlando, Florida (2%); and various locations within the continental U.S. (2%), and is expected to be completed November 2028. FMS funds in the amount of $140,827,737, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract was not competed. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Dynetics Inc., Huntsville, Alabama, is awarded a $24,863,649 hybrid, other transaction agreement to manufacture, deliver, and support six Medium Range Air Defense Radar Production Representative Model systems. The hybrid agreement also covers other direct costs and associated engineering, new equipment training, reach back support, and program management support, all necessary materials, and supplies. Work will be performed at Huntsville, Alabama (87.5%); and Woodlake, California (12.5%), and is expected to be completed in September 2027. The maximum dollar value is $24,863,649. America's Mid-Band Initiative Team Spectrum 5G (AMBIT/5G) funds in the amount of $12,972,729; and fiscal 2025 procurement (Marine Corps) funds in the amount of $11,890,920, are obligated at time of award and will not expire at the end of the current fiscal year. The requirement was procured under the authority of 10 U.S. Code 4022 as a follow-on agreement to the prototype agreement M67854-23-9-0023. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-9-0122).",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Metalex Manufacturing Inc. (Metalex),* Cincinnati, Ohio, is awarded a $10,592,560 cost-plus-incentive-fee and cost-plus-fixed-fee completion contract (N0016725C0007) for the qualification and machining of improved advanced hybrid rotors. Work will be performed in Cincinnati, Ohio, and is expected to be completed by October 2027. This contract includes options which, if exercised, would bring the cumulative value of this contract to $33,214,154. If all options are exercised, work will continue through August 2031. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $10,592,560 will be obligated at the time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured under the authority of 10 U.S Code 3204(a)(3)(A) as implemented by Federal Acquisition Regulation 6.302-3 via the Federal Business Opportunities website, with one offer received. Naval Surface Warfare Center Carderock Division, West Bethesda, Maryland, is the contracting activity.",
    "contract_date": "2025-07-22"
  },
  {
    "text": "Oshkosh Defense LLC, Oshkosh, Wisconsin, has been awarded an estimated $8,814,253 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for diesel engines. This was a sole-source acquisition using justification 10 U.S. Code 3204 (a)(1), as stated in Federal Acquisition Regulation 6.302-1. This is a five-year contract with no option periods. The performance completion date is Oct. 5, 2031. Using military service is Army. Type of appropriation is fiscal 2025 through 2030 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-25-D-0065).",
    "contract_date": "2025-07-22"
  },
  {
    "text": "UPDATE: SDV Office Systems LLC, doing business as SDV Medical,* Fletcher, North Carolina (SPE2D1-25-D-0006, $360,000,000), has been added as an awardee to the multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DH-21-R-0002 and awarded Feb. 10, 2022. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-07-22"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-22"
  }
]