[
  {
    "text": "Airborne Tactical Advantage Co. LLC, Newport News, Virginia, is awarded a $554,464,830 firm-fixed-price, indefinite-delivery/indefinite-quantity contract that provides contractor-owned and operated Type III high subsonic and Type IV supersonic aircraft to Navy fleet customers for a wide variety of airborne threat simulation capabilities, training, and certification events in support of training aircraft squadron aircrew and shipboard system operators on how to counter potential enemy advanced airborne threats, tactics, and electronic warfare. Work will be performed in Pt. Mugu, California (44%); Oceana, Virginia (37%); Kaneohe Bay, Hawaii (14%); and Atsugi, Japan (5%), and is expected to be completed in August 2030. No funds will be obligated at the time of the award; funds will be obligated on individual orders as they are issued. This contract was competed; one offer was received. Naval Air Warfare Center, Aircraft Division, Patuxent River, Maryland, is the contracting activity (N0042125D0084).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Raytheon Missiles and Defense, Tucson, Arizona, was awarded a $32,519,000 firm-fixed price undefinitized contract action for medium range intercept capability (MRIC). The contract provides for the purchase of 44 sets of long lead items (LLIs) for the full rate production (FRP) of the MRIC, along with additional quantities of LLIs for spares and upgrading the prototype systems that have already been procured. This work will be performed in Tucson, Arizona (100%) with a final delivery date of Nov. 22, 2027. The not-to-exceed dollar amount is $32,519,000. Fiscal 2023 procurement (Marine Corps) in the amount of $381,696, and fiscal 2025 procurement (Marine Corps) funds in the amount of $18,304 were obligated at the time of award for a total of $400,000, and the funds will not expire this fiscal year. This contract was a sole source acquisition pursuant to Federal Acquisition Regulation 6.302-1. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-C-0111). (Awarded May 22, 2025)",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Sikorsky Aircraft Corp., a Lockheed Martin Co., Stratford, Connecticut, is awarded a $21,629,891 cost-plus-fixed-fee, firm-fixed-price order (N0001925F0193) against a previously issued basic ordering agreement (N0001923G0002). This order provides for non-recurring engineering for the CH-53K to include main gearbox, intermediate gearbox, fuselage fatigue test article, empennage fatigue test article testing, and their associated technical data deliveries, as well as installation of a redesigned wheel brake system on a CH-53K test aircraft in support of the Navy and Marine Corps. Work will be performed in Stratford, Connecticut and is expected to be completed in December 2027. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $3,677,023 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "General Electric Co., Lynn, Massachusetts, is being awarded $20,703,888 for a not-to-exceed delivery order N00383-25-F-TF0F under a previously awarded basic ordering agreement (N00383-22-G-TF01) for the repair 23 low pressure turbine rotors, eight fan rotors, 27 high pressure turbine rotors, six fan stator assemblies, 21 high pressure compressor rotors, 22 combustion chamber cases, nine high pressure compressor case and vanes, 12 high pressure compressor outer bypass duct assemblies, and 14 high pressure turbine shroud support in support of the F404 engine. The delivery order does not include an option period. All work will be performed in Lynn, Massachusetts. Work is expected to be completed by January 2027. Working capital funds (Navy) will be obligated in the amount of $15,527,916, and funds will not expire at the end of the current fiscal year. One company was solicited for this non-competitive requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Lockheed Martin Rotary and Missions Systems Owego, New York, is awarded a $18,828,520 modification (P00002) to a firm-fixed-price order (N0001924F1883) against a previously issued basic ordering agreement (N0001923G0002). This modification exercises options to procure 25 Digital Magnetic Anomaly Detection hardware kits, eight kits for the Navy and 17 kits for the Royal Australian Navy as well associated program management support. Work will be performed in Owego, New York, and is expected to be completed in January 2027. Fiscal 2025 aircraft procurement (Navy) funds in the amount of $2,259,423; fiscal 2024 national guard and reserve equipment appropriations (NGREA) (Defense-wide) funds in the amount of $2,244,084; fiscal 2023 NGREA (Defense-wide) funds in the amount of $1,521,620; and Foreign Military Sales funds in the amount of $12,803,393, will be obligated at the time of award, $1,521,620 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "QorTek Inc.,* Linden, Pennsylvania, is awarded a $12,380,613 indefinite-delivery/indefinite-quantity type contract with firm-fixed-price provisions for the manufacture of DT-100 Staves. This contract includes an ordering period of five years. Work will be performed in Linden, Pennsylvania, and is expected to continue through August 2030 with the latest possible delivery taking place 13 months thereafter. Fiscal 2024 other procurement (Navy) funds in the amount of $4,322,892 (71%); fiscal 2025 shipbuilding and conversion (Navy) in the amount of $1,357,458 (22%); and fiscal 2025 national sea-based deterrence fund in the amount of $422,385 (7%), will be obligated on the first delivery order immediately following award of the basic contract and will not expire at the end of the current fiscal year. This contract was competitively procured, as a small business set-aside, via the System for Award Management website, with two offers received. Naval Undersea Warfare Center Division Newport, Newport, Rhode Island, is the contracting activity (N66604-25-D-U500).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Siemens Industry Inc., Buffalo Grove, Illinois, was awarded a $99,300,000 requirements, indefinite-delivery contract for the Switchgear Replacement Effort. This contract provides for mission requirements for the Arnold Engineering Development Complex and its associated geographically separated units to necessitate the acquisition of iso-phase gas-insulated switchgear that includes a valid original equipment manufacturer warranty. Work is expected to be completed by July 23, 2030. This contract was a sole source acquisition. No funds are being obligated at the time of the award. The Air Force Test Center, Arnold Air Force Base, Tennessee, is the contracting activity (FA9101-25-D-B007).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Cubic Defense Acquisition Inc., San Diego, California, was awarded a $44,155,395 firm-fixed-price, delivery order contract for P5 Combat Training System under indefinite-delivery/indefinite-quantity (FA8210-25-D-B001). This contract provides for the Block 7 and Pods purchase under the previously mentioned contract. Work will be performed at San Diego, California, and is expected to be completed by March 24, 2028. This contract was a sole source acquisition. Fiscal 2025 research, development, test and evaluation funds in the amount of $7,767,871; fiscal 2024 aircraft procurement funds in the amount of $15,131,437; and fiscal 2025 aircraft procurement funds in the amount of $21,256,087, will be obligated at the time of award. The Air Force Life Cycle Management Center, Hill Air Force Base, Utah, is the contracting activity (FA8210-25-F-B009).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "RTX BBN Technologies Inc., Cambridge, Massachusetts, was awarded a $33,708,763 cost-plus-fixed-fee, completion contract for the Apex Gear Drive: Air Plan Environment for Execution, Gaming, Exploration, Assessment, and Refinement: Data Refinement, Integration and Visualization Enhancements. This contract provides for an integrated prototype to be linked to external systems to support full-scale scenarios developed and conducted in close cooperation with representatives from operational and acquisition communities. Work will be performed at Cambridge, Massachusetts, and is expected to be completed by Oct. 22, 2027. This contract was a competitive acquisition with one offer received. Fiscal 2025 Air Force research, development, test and evaluation funds in the amount of $397,085 are being obligated at time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-25-C-B064).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Forest Products Distributors Inc.,* Rapid City, South Dakota (SPE8E6-25-D-0004); Wholesale Building Products LLC,* Jacksonville, Florida (SPE8E6-25-D-0005); Progressive Services Corp.,* Beaverton, Oregon (SPE8E6-25-D-0006); and S&S Forest Products LLC,* Boerne, Texas (SPE8E6-25-D-0007), are sharing a maximum $50,000,000 fixed-price, indefinite-delivery/indefinite-quantity contract under solicitation SPE8E6-25-R-0001 for various types of wood products. This was a competitive acquisition with 12 responses received. These are two-year base contracts with three one-year option periods. The ordering period end date is July 23, 2027. Using customers are Army, Navy, Air Force, Marine Corps, and Coast Guard. Type of appropriation is 2025 through 2027 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Re-Engineered Business Solutions Inc.,* Cocoa, Florida, was awarded a cost-no-fee, firm-fixed-price contract for base operations on Fort Hamilton. The amount of this action is $42,709,226. Bids were solicited via the internet with five received. Work will be performed in Brooklyn, New York with an estimated completion date of July 23, 2030. Fiscal 2025 operation and maintenance, Army funds in the amount of $805,304 were obligated at the time of the award. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-25-C-A024).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Renk America LLC, Muskegon, Michigan, was awarded a $26,756,813 modification (P00076) to contract W56HZV-20-C-0124 for transmission and ancillary hardware. Work will be performed in Muskegon, Michigan, with an estimated completion date of Aug. 31, 2027. Fiscal 2025 Army working capital funds in the amount of $17,555,109 and were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Colby Co. LLC,* Portland, Maine (W912WJ-25-D-0001); MJ Engineering, Architecture, Landscape Architecture and Land Surveying P.C.,* Halfmoon, New York (W912WJ-25-D-0002); and Dills Architects CDM Smith JV,* Virginia Beach, Virginia (W912WJ-25-D-0003), will compete for each order of the $24,000,000 firm-fixed-price contract for perform general engineering and design services for various locations. Bids were solicited via the internet with 12 received. Work locations and funding will be determined with each order, with an estimated completion date of July 24, 2030. U.S. Army Corps of Engineers, New England District, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "MEB General Contractors Inc., Chesapeake, Virginia, was awarded a firm-fixed-price contract for refueler truck pantograph fuel stands and a ground vehicle fueling station. The amount of this action is $19,766,000 with a cumulative total face value of $20,395,500. Bids were solicited via the internet with three received. Work will be performed in on Whiteman Air Force Base with an estimated completion date of Aug. 02, 2027. Fiscal 2025 military construction, defense-wide funds in the amount of $19,766,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Kansas City, Missouri, is the contracting activity (W912DQ-25-C-A010).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "Amentum Services Inc., Chantilly, Virginia, was awarded a $17,581,762 modification (P00042) to contract W58RGZ-25-C-0003 for worldwide aviation maintenance. The modification brings the total cumulative face value of the contract to $186,835,420. Work will be performed in Fort Drum, New York; Fort Campbell, Kentucky; Winder, Georgia; and Shelbyville, Tennessee, with an estimated completion date of Nov. 28, 2025. Fiscal 2025 aircraft procurement; and operation and maintenance, Army funds in the amount of $17,581,762 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "R.E. Staite Engineering Inc.,* San Diego, California, was awarded a firm-fixed-price contract for maintenance dredging in Newport Bay Harbor. The amount of this action is $42,709,226. Bids were solicited via the internet with four received. Work will be performed in Newport Beach, California, with an estimated completion date of June 05, 2026. Fiscal 2022 civil construction funds in the amount of $13,945,200 were obligated at the time of the award. U.S. Army Corps of Engineers, Los Angeles, California, is the contracting activity (W912PL-25-C-0019).",
    "contract_date": "2025-07-24"
  },
  {
    "text": "NTS Technical Systems LLC, Belcamp, Maryland (W91CRB-25-D-A004); and Oregon Ballistics Laboratories LLC, Salem, Oregon (W91CRB-25-D-A005), will compete for each order of the $13,021,816 cost-no-fee, firm-fixed-price contract to perform personal protective equipment ballistic and non-ballistic testing. This total cumulative face value is $26,043,634. Bids were solicited via the internet with two received. Work locations and funding will be determined with each order, with an estimated completion date of July 23, 2029. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "CORRECTION: The $231,878,229 contract (W9124J-25-F-A075) awarded on July 18, 2025, to Acquisition Logistics LLC, Henrico, Virginia, to establish and operate a 5,000 capacity, single adult, short-term detention facility for the U.S. Immigration and Customs Enforcement in support of Presidential Executive Order 14159, has a total cumulative face value of $1,238,567,966.",
    "contract_date": "2025-07-24"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-24"
  }
]