[
  {
    "text": "Lockheed Martin Corp., Orlando, Florida, was awarded a $999,000,000 indefinite-delivery/indefinite-quantity contract for Joint Air to Surface Standoff Missile (JASSM) and Long-Range Anti-Ship Missile production support (LRASM). This contract provides for lifecycle support for all efforts related to JASSM, LRASM (Air Force Inventory) and all their variants in the areas of system upgrades, integration, production, sustainment, management and logistical support. Work will be performed at Orlando, Florida, and is expected to be complete by July 17, 2030. This contract was a sole source acquisition. No funds are being obligated at the time of award. The Air Force Life Cycle Management Center, Eglin Air Force Base, Florida, is the contracting activity (FA8682‐25-D-B001).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Northrop Grumman Systems Corp., Fort Worth, Texas, has been awarded $11,737,827 modification (P00031) to previously awarded (FA8617-21-C-6237) for contractor logistics support of Iraq's C-172 & C-208 fleets. The modification brings the total cumulative face value of the contract to $58,886,759 to $70,624,586. Work will be performed at Martyr BG Ali Flaih Air Base (formerly Balad Air Base, Iraq) and is expected to be completed by June 30, 2026. This contract involves Foreign Military Sales (FMS) to Iraq. FMS funds in the amount of $11,737,827 are being obligated at time of award. The Air Force Life Cycle Management Center, Legacy Training Aircraft Division, Rapid Acquisition and Sustainment Management Branch, Wright Patterson Air Force Base, Ohio, is the contracting activity. (Awarded June 30, 2025.)",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Acquisition Logistics LLC, Henrico, Virginia, was awarded a $231,878,229 firm-fixed-price contract to establish and operate a 5,000 capacity, single adult, short-term detention facility for the U.S. Immigration and Customs Enforcement in support of Presidential Executive Order 14159. Bids were solicited via the internet with 13 received. Work will be performed in El Paso, Texas, with an estimated completion date of Sept. 30, 2027. Fiscal 2025 operation and maintenance, Army funds in the amount of $231,878,229 were obligated at the time of the award. Army Field Directorate Office, Fort Sam Houston, Texas, is the contracting activity (W9124J-25-F-A075). (Awarded July 18, 2025.)",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Benham - Mead & Hunt, Oklahoma City, Oklahoma (W912HP-25-D-A006); Cems Engineering Inc.,* Summerville, South Carolina (W912HP-25-D-A007); Cromwell Architects Engineers Inc.,* Little Rock, Arkansas (W912HP-25-D-A008); IMEG-PRIME AE JV LLC., Rock Island, Illinois (W912HP-25-D-A009); and The Mason & Hanger Group Inc., Lexington, Kentucky (W912HP-25-D-A010), will compete for each order of the $99,000,000 firm-fixed-price contract for architect-engineer services. Bids were solicited via the internet with 23 received. Work locations and funding will be determined with each order, with an estimated completion date of July 21, 2030. U.S. Army Corps of Engineers, Charleston, South Carolina, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Sevenson Environmental Services Inc.,* Niagara Falls, New York, was awarded a $49,000,000 firm-fixed-price contract for excavation of waste contaminated soils and sediments at the Raymark Superfund Site. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of July 20, 2030. U.S. Army Corps of Engineers, Concord, Massachusetts, is the contracting activity (W912WJ-25-D-0004).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "CodeMettle LLC, Atlanta, Georgia, was awarded a $45,245,217 firm-fixed-price contract to provide enterprise license and support services. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 20, 2030. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W15P7T-25-D-0008).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "General Dynamics Land Systems, Sterling Heights, Michigan, was awarded a $27,433,287 modification (P00107) to contract W56HZV-22-C-0012 for Abrams system technical support. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 28, 2026. Fiscal 2025 other procurement, Army; and Foreign Military Sales funds (Australia, Poland), in the amount of $27,433,287, were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Shiers Communication Specialists Inc.,* Vicksburg, Mississippi, was awarded a $22,950,000 firm-fixed-price contract for voice, video and data communications networks. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of July 20, 2030. U.S. Army Corps of Engineers' Engineer Research and Development Center, Vicksburg, Mississippi, is the contracting activity (W912HZ-25-D-A001).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Valiant Government Services LLC, Fayetteville, North Carolina, was awarded a $22,074,477 modification (P00010) to contract W91278-24-C-0038 for operations and maintenance services. Work will be performed in Fort Detrick, Maryland, with an estimated completion date of July 21, 2026. Fiscal 2025 Defense Health Program funds in the amount of $22,074,477 were obligated at the time of the award. U.S. Army Corps of Engineers, Mobile, Alabama, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Great Lakes Dredge & Dock Co LLC, Houston, Texas, was awarded a $7,739,870 modification (P00002) to contract W912P8-25-C-0012 to increase the contract quantity by 53 days. Work will be performed in Venice, Louisiana, with an estimated completion date of Nov. 5, 2025. Fiscal 2025 civil operation and maintenance funds in the amount of $7,739,870 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans, Louisiana, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "General Dynamics Electric Boat Corp., Groton, Connecticut, is awarded a $159,675,741 cost-plus-fixed-fee modification to a previously awarded contract (N00024-17-C-2100) to establish five contract line-item numbers (CLINs), each procuring a shipset of onboard repair parts for Virginia-class submarines SSN 802-806. Each CLIN is an order placed on a sole source basis under the authority of the \"Orders\" clause G-216-H002 Orders (Naval Sea Systems Command) (March 2019) and 10 U.S. Code 2304 (c)(1). Work will be performed in Groton, Connecticut, and is expected to complete by November 2029. This contract action includes options for five follow-on onboard repair parts shipset CLINs that if exercised would increase the cumulative value of the contract by $176,140,177. If all options are exercised, work will continue through February 2032. Fiscal 2019 shipbuilding and conversion (Navy) funds in the amount of $10,000,000 (40%); fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $10,000,000 (40%); and fiscal 2021 shipbuilding and conversion (Navy) funds in the amount of $5,000,000 (20%), will be obligated at the time of award, $5,000,000 of which will expire at the end of the current fiscal year. Supervisor of Shipbuilding Groton, Groton, Connecticut, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "The Pennsylvania State University, University Park, Pennsylvania, is being awarded a sole-source indefinite-delivery/indefinite-quantity contract in the amount of $99,000,000 for the Navy Manufacturing Technology (ManTech) Electro Optics Center of Excellence. The Pennsylvania State University is an educational institution. The contractor will operate and manage the Electro Optics Center of Excellence (herein EOC or the Center) in its mission to develop naval platform-related manufacturing technologies and transition the technology for implementation in United States electro optics and other industrial facilities. In addition to accomplishing the Centers core mission, the contractor shall manage, operate, sustain, and enhance the Centers ability to function as an Office of Naval Research (ONR) ManTech Center of Excellence. Work will be performed at University Park, Pennsylvania. The maximum dollar value, over the 5-year ordering period from July 21, 2025, through July 21, 2030, with a five-year ordering period option through July 21, 2035, is $99,000,000. Fiscal 2025 research, development, test and evaluation funds in the amount of $859,940 will be obligated on a cost-plus-fixed-fee task order at time of award. The first task order will be issued for a cost-plus-fixed-fee total of $399,940. The second task order will be issued for a cost-plus-fixed-fee total of $460,000. ONR, Arlington, Virginia, is the contracting activity (N00014-25-R-7001).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "The Boeing Co., St. Louis, Missouri is awarded a $91,832,523cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract to provide post-production engineering, logistics, and technical support for the T-45 aircraft, as well as associated systems, subsystems, support equipment and ancillary equipment in support of lifecycle sustainment of the T-45 platform for the Navy. Work will be performed in St. Louis, Missouri (95%); and Balderstone, Lancashire, United Kingdom (5%), and is expected to be completed in July 2030. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was not competed pursuant to Federal Acquisition Regulation 6.302-1(a)(2)(iii)(B). Naval Air Warfare Center Aircraft Division, Patuxent River, Maryland, is the contracting activity (N0042125D0085).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "JCB Inc., Pooler, Georgia, is awarded a $45,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for the backhoe loader (BHL). The intent of this contract is to procure BHLs replacing the current BHL which is reaching the end of its economical service life. Work will be performed in Pooler, Georgia, and is expected to be completed in July 2033. This contract is awarded based on a full and open competitive solicitation. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-25-D-5302).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "General Dynamics Electric Boat Corp., Groton, Connecticut, is awarded a $31,500,000 cost-plus-fixed-fee undefinitized contract action modification to a previously awarded contract (N00024-20-C-2120) for lead yard support and development studies and design efforts related to Virginia-class submarines. Work will be performed in the continental U.S. and is expected to be completed by June 2028. No additional funding will be obligated at time of award. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Vectrus Systems LLC, Colorado Springs, Colorado, is awarded a $10,063,917 firm-fixed-price, indefinite-delivery/indefinite-quantity modification to previously awarded contract (N62470-20-D-0004). This award brings the total cumulative value to $60,541,752. This modification provides for the exercise of option five for base operating support services at Naval Support Facility Deveselu. Work will be performed in Deveselu, Romania, and is expected to be completed by July 2026. No funds will be obligated at time of award. Fiscal 2025 operation and maintenance (Navy) funds will be obligated on individual task orders, subject to the availability of funds. The Naval Facilities Engineering Systems Command, Europe, Africa, Central, is the contracting activity.",
    "contract_date": "2025-07-21"
  },
  {
    "text": "Woodward HRT Inc., Valencia, California, has been awarded a maximum $8,037,600 firm-fixed-price, one-time-buy contract for F-15 engine linear actuating caps. This was a sole-source acquisition using justification 10 U.S. Code 3204 (c)(1), as stated in Federal Acquisition Regulation 6.302-1 (a)(2). The performance completion date is Oct. 31, 2028. Using military service is Air Force. Type of appropriation is fiscal 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Oklahoma City, Oklahoma (SPRTA1-25-C-0006).",
    "contract_date": "2025-07-21"
  },
  {
    "text": "*Small business",
    "contract_date": "2025-07-21"
  }
]