[
  "ARMY",
  "AGM Marine Contractors Inc.,* New Bedford, Massachusetts (W912EP-25-D-0011); Ahtna Marine & Construction Co. LLC,* Boynton Beach, Florida (W912EP-25-D-0012); Atlantic & Gulf Dredging & Marine LLC,* Indiantown, Florida (W912EP-25-D-0013); Coastal Dredging Co. Inc.,* Hammond, Louisiana (W912EP-25-D-0014); Cottrell Contracting Corp.,* Chesapeake, Virginia (W912EP-25-D-0015); Next Generation Logistics LLC,* New Orleans, Louisiana (W912EP-25-D-0016); Southern Dredging Co., Inc.,* Charleston, South Carolina (W912EP-25-D-0017); Southwind Construction Corp.,* Evansville, Indiana (W912EP-25-D-0018); and Waterfront Property Services LLC, doing business as Gator Dredging,* Clearwater, Florida (W912EP-25-D-0019), will compete for each order of the $400,000,000 firm-fixed-price contract for maintenance dredging. Bids were solicited via the internet with nine received. Work locations and funding will be determined with each order, with an estimated completion date of July 17, 2030. U.S. Army Corps of Engineers, Jacksonville, Florida, is the contracting activity.",
  "Johnson Controls Building Automation Systems LLC, Huntsville, Alabama, was awarded a $377,998,800 firm-fixed-price contract for the procurement, installation, maintenance, and service of building automation systems. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of July 16, 2030. U.S. Army Corps of Engineers, Huntsville, Alabama, is the contracting activity (W912DY-25-D-A008).",
  "QED Systems LLC,* Aberdeen Proving Ground, Maryland, was awarded a $76,366,018 cost-plus-fixed-fee contract for positioning, navigation and timing product support services. Bids were solicited via the internet with five received. Work will be performed in Aberdeen Proving Ground, Maryland, with an estimated completion date of Dec. 31, 2030. Fiscal 2025 other procurement, Army funds in the amount of $1,709,470 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W56KGY-25-F-0102).",
  "Water Resources Associates, Tampa, Florida (W912DY-25-D-A001); Poly Inc., Dothan, Alabama (W912DY-25-D-A003); The Mason and Hanger Group Inc., Lexington, Kentucky (W912DY-25-D-A004); Benham Design LLC, Oklahoma City, Oklahoma (W912DY-25-D-A005); and AECOM Garver CEHNC JV, Houston, Texas (W912DY-25-D-A006), will compete for each order of the $49,000,000 firm-fixed-price contract for architect-engineering services in support of range construction. Bids were solicited via the internet with five received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 25,2030. U.S. Army Corps of Engineers' Engineering and Support Center, Huntsville, Alabama, is the contracting activity.",
  "Cottrell Contracting Corp.,* Chesapeake, Virginia, was awarded a $9,639,180 firm-fixed-price contract for maintenance dredging. Bids were solicited via the internet with four received. Work will be performed in Lewes, Delaware, with an estimated completion date of May 24, 2027. Fiscal 2022, 2023, and 2025 civil operation and maintenance funds in the amount of $9,639,180 were obligated at the time of the award. U.S. Army Corps of Engineers, Philadelphia, Pennsylvania, is the contracting activity (W912BU-25-C-A009).",
  "American Mine Services LLC,* Lafayette, Colorado, was awarded a $8,439,911 firm-fixed-price contract for dam generator water cooling system rehabilitation. Bids were solicited via the internet with three received. Work will be performed in Rufus, Oregon, with an estimated completion date of July 27, 2027. Fiscal 2025 Bonneville Power Administration funds in the amount of $8,439,911 were obligated at the time of the award. U.S. Army Corps of Engineers, Portland, Oregon, is the contracting activity (W9127N-25-C-A041).",
  "NAVY",
  "EWA Government Systems Inc. (EWA GSI), Herndon, Virginia, is awarded a $63,678,054 cost-plus-fixed-fee contract (N0042125C0030). This contract provides technical support, upgrade, sustainment, and modeling and simulation support for EWA GSI proprietary stimulator and simulation systems installed in the Naval Air Systems Command (NAVAIR) ground test sites. Work will be performed in Patuxent River, Maryland (90%); and Herndon, Virginia (10%), and is expected to be completed in July 2030. Fiscal 2025 research, development, test and evaluation funds in the amount of $5,369,450 will be obligated at the time of the award. This contract was not competed pursuant to Federal Acquisition Regulation 6.302-1. NAVAIR, Patuxent River, Maryland, is the contracting activity.",
  "Global PCCI, Irvine, California, is awarded a $36,600,000 cost-plus-award-fee and cost-plus-fixed-fee modification to a previously awarded indefinite-delivery/indefinite-quantity contract (N00024-19-D-4323) for the Emergency Ship Salvage Material system. This modification increases the contract ordering ceiling from $330,200,000 to $366,800,000. Work will be performed in Irvine, California; and other locations worldwide, and is expected to be completed by March 2026. No funding will be obligated at the time of award; all funding will be made available at the task or delivery order level as contracting actions occur. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
  "The Boeing Co., St. Louis, Missouri, is being awarded $14,475,800 for a ceiling-priced delivery order (N00383-25-F-YY26) under a previously awarded basic ordering agreement (N00383-22-G-YY01) for the manufacture of spares for 54 trailing edge flap shrouds used on the F/A-18 E/F and EA-18G aircraft. The delivery order does not include an option provision. Work will be performed in Hazelwood, Missouri (97%); and St. Louis, Missouri (3%). Work is expected to be completed by September 2029. Fiscal 2025 working capital funds (Navy) in the amount of $7,289,142 will be obligated at the time of award as an undefinitized contract action, and funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.",
  "Northrop Grumman Systems Corp., Baltimore, Maryland, is awarded an $8,274,168 cost-plus-fixed fee modification to a previously awarded contract (N0016421GWS42); (N0016425FW016) for engineering, logistics, and repair services for the EA-18G Airborne Electronic Attack Suite and P-8A AN/ALQ-240 systems and all variants/derivatives of these systems. Work will be performed in Linthicum, Maryland (90%); Bethpage, New York (8%); and San Diego, California (2%), and is expected to be completed by December 2026. Fiscal 2025 operations and maintenance (Navy) funds in the amount of $605,000 (32%); Foreign Military Sales (Australia) funds in the amount of $406,207 (21%); fiscal 2025 aircraft procurement (Navy) funds in the amount of $200,000 (10%); and reimbursable funds in the amount of $700,152 (37%), will be obligated at time of award, of which $605,000 will expire at the end of the current fiscal year. Naval Surface Warfare Center, Crane, Indiana, is the contracting activity (N0016421GWS42; N0016425FW016).",
  "Bath Iron Works (BIW), Bath, Maine (N00024-22-C-2318); and Huntington Ingalls Industries Inc., Ingalls Shipbuilding (HII Ingalls), Pascagoula, Mississippi (N00024-22-C-2319), are each being awarded a cost-plus-award-fee modification to previously-awarded contracts to exercise options for the accomplishment of shipbuilder engineering and design analysis to produce design products in support of the Guided Missile Destroyer preliminary design and contract design. BIW work will be performed in Bath/Brunswick, Maine (99%); and Washington, D.C. (1%), and is expected to be completed by July 2026. HII Ingalls work will be performed in Pascagoula, Mississippi (84%); Avondale, Louisiana (12%); and Newport News, Virginia (4%), and is expected to be completed by July 2026. If all options are exercised, work will continue through July 2028 for each respective contract. Fiscal 2024 research, development, test, and evaluation (Navy) funds will be obligated at the time of award for each contract and will expire at the end of the current fiscal year; and fiscal 2025 research, development, test, and evaluation (Navy) funds, will be obligated at time of award for each contract and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.",
  "*Small business"
]